[Survived] BooleanLiteral
src/lib/bed-plants.ts:34:7
 const MIN_PLANTED_YEAR = 1900;
 
 export function validateCreateBedPlantInput(value: unknown): BedPlantValidationResult {
-  if (!isRecord(value)) {
+  if (isRecord(value)) {
     return { success: false, error: "Plant payload must be an object." };
   }

[Survived] BlockStatement
src/lib/bed-plants.ts:34:25
 const MIN_PLANTED_YEAR = 1900;
 
 export function validateCreateBedPlantInput(value: unknown): BedPlantValidationResult {
-  if (!isRecord(value)) {
-    return { success: false, error: "Plant payload must be an object." };
-  }
+  if (!isRecord(value)) {}
 
   const name = value.name;

[Survived] BooleanLiteral
src/lib/bed-plants.ts:35:23
 
 export function validateCreateBedPlantInput(value: unknown): BedPlantValidationResult {
   if (!isRecord(value)) {
-    return { success: false, error: "Plant payload must be an object." };
+    return { success: true, error: "Plant payload must be an object." };
   }
 

[Survived] MethodExpression
src/lib/bed-plants.ts:39:35
   }
 
   const name = value.name;
-  if (typeof name !== "string" || name.trim().length === 0) {
+  if (typeof name !== "string" || name.length === 0) {
     return { success: false, error: "Plant name is required." };
   }

[Survived] ConditionalExpression
src/lib/bed-plants.ts:39:7
   }
 
   const name = value.name;
-  if (typeof name !== "string" || name.trim().length === 0) {
+  if (true) {
     return { success: false, error: "Plant name is required." };
   }

[Survived] BooleanLiteral
src/lib/bed-plants.ts:40:23
 
   const name = value.name;
   if (typeof name !== "string" || name.trim().length === 0) {
-    return { success: false, error: "Plant name is required." };
+    return { success: true, error: "Plant name is required." };
   }
 

[Survived] ObjectLiteral
src/lib/bed-plants.ts:40:12
 
   const name = value.name;
   if (typeof name !== "string" || name.trim().length === 0) {
-    return { success: false, error: "Plant name is required." };
+    return {};
   }
 

[Survived] StringLiteral
src/lib/bed-plants.ts:45:5
 
   const plantedYear = readOptionalNumber(
     value,
-    "planted_year",
+    "",
     `Planted year must be an integer from ${MIN_PLANTED_YEAR} through the current year.`,
     isValidPlantedYear,

[Survived] StringLiteral
src/lib/bed-plants.ts:46:5
   const plantedYear = readOptionalNumber(
     value,
     "planted_year",
-    `Planted year must be an integer from ${MIN_PLANTED_YEAR} through the current year.`,
+    ``,
     isValidPlantedYear,
   );

[Survived] ConditionalExpression
src/lib/bed-plants.ts:49:7
     `Planted year must be an integer from ${MIN_PLANTED_YEAR} through the current year.`,
     isValidPlantedYear,
   );
-  if (!plantedYear.success) return plantedYear;
+  if (true) return plantedYear;
 
   const quantity = readOptionalNumber(value, "quantity", "Quantity must be a positive integer.", isPositiveInteger);

[Survived] BooleanLiteral
src/lib/bed-plants.ts:49:7
     `Planted year must be an integer from ${MIN_PLANTED_YEAR} through the current year.`,
     isValidPlantedYear,
   );
-  if (!plantedYear.success) return plantedYear;
+  if (plantedYear.success) return plantedYear;
 
   const quantity = readOptionalNumber(value, "quantity", "Quantity must be a positive integer.", isPositiveInteger);

[Survived] StringLiteral
src/lib/bed-plants.ts:51:58
   );
   if (!plantedYear.success) return plantedYear;
 
-  const quantity = readOptionalNumber(value, "quantity", "Quantity must be a positive integer.", isPositiveInteger);
+  const quantity = readOptionalNumber(value, "quantity", "", isPositiveInteger);
   if (!quantity.success) return quantity;
 

[Survived] ConditionalExpression
src/lib/bed-plants.ts:52:7
   if (!plantedYear.success) return plantedYear;
 
   const quantity = readOptionalNumber(value, "quantity", "Quantity must be a positive integer.", isPositiveInteger);
-  if (!quantity.success) return quantity;
+  if (true) return quantity;
 
   const height = readOptionalNumber(value, "height_cm", "Current height must be a positive number.", isPositiveNumber);

[Survived] BooleanLiteral
src/lib/bed-plants.ts:52:7
   if (!plantedYear.success) return plantedYear;
 
   const quantity = readOptionalNumber(value, "quantity", "Quantity must be a positive integer.", isPositiveInteger);
-  if (!quantity.success) return quantity;
+  if (quantity.success) return quantity;
 
   const height = readOptionalNumber(value, "height_cm", "Current height must be a positive number.", isPositiveNumber);

[Survived] StringLiteral
src/lib/bed-plants.ts:54:44
   const quantity = readOptionalNumber(value, "quantity", "Quantity must be a positive integer.", isPositiveInteger);
   if (!quantity.success) return quantity;
 
-  const height = readOptionalNumber(value, "height_cm", "Current height must be a positive number.", isPositiveNumber);
+  const height = readOptionalNumber(value, "", "Current height must be a positive number.", isPositiveNumber);
   if (!height.success) return height;
 

[Survived] ConditionalExpression
src/lib/bed-plants.ts:55:7
   if (!quantity.success) return quantity;
 
   const height = readOptionalNumber(value, "height_cm", "Current height must be a positive number.", isPositiveNumber);
-  if (!height.success) return height;
+  if (false) return height;
 
   const width = readOptionalNumber(value, "width_cm", "Current width must be a positive number.", isPositiveNumber);

[Survived] ConditionalExpression
src/lib/bed-plants.ts:55:7
   if (!quantity.success) return quantity;
 
   const height = readOptionalNumber(value, "height_cm", "Current height must be a positive number.", isPositiveNumber);
-  if (!height.success) return height;
+  if (true) return height;
 
   const width = readOptionalNumber(value, "width_cm", "Current width must be a positive number.", isPositiveNumber);

[Survived] StringLiteral
src/lib/bed-plants.ts:57:43
   const height = readOptionalNumber(value, "height_cm", "Current height must be a positive number.", isPositiveNumber);
   if (!height.success) return height;
 
-  const width = readOptionalNumber(value, "width_cm", "Current width must be a positive number.", isPositiveNumber);
+  const width = readOptionalNumber(value, "", "Current width must be a positive number.", isPositiveNumber);
   if (!width.success) return width;
 

[Survived] BooleanLiteral
src/lib/bed-plants.ts:58:7
   if (!height.success) return height;
 
   const width = readOptionalNumber(value, "width_cm", "Current width must be a positive number.", isPositiveNumber);
-  if (!width.success) return width;
+  if (width.success) return width;
 
   return {

[Survived] ConditionalExpression
src/lib/bed-plants.ts:58:7
   if (!height.success) return height;
 
   const width = readOptionalNumber(value, "width_cm", "Current width must be a positive number.", isPositiveNumber);
-  if (!width.success) return width;
+  if (false) return width;
 
   return {

[Survived] MethodExpression
src/lib/bed-plants.ts:63:13
   return {
     success: true,
     data: {
-      name: name.trim(),
+      name: name,
       planted_year: plantedYear.value,
       quantity: quantity.value,

[Survived] BlockStatement
src/lib/bed-plants.ts:76:26
   input: CreateBedPlantInput,
   bedId: string,
   userId: string,
-): BedPlantInsertPayload {
-  return {
-    bed_id: bedId,
-    user_id: userId,
-    name: input.name,
-    planted_year: input.planted_year ?? null,
-    quantity: input.quantity ?? null,
-    height_cm: input.height_cm ?? null,
-    width_cm: input.width_cm ?? null,
-  };
-}
+): BedPlantInsertPayload {}
 
 export function toBedPlantResponse(row: BedPlantRow): BedPlantResponse {

[Survived] LogicalOperator
src/lib/bed-plants.ts:81:19
     bed_id: bedId,
     user_id: userId,
     name: input.name,
-    planted_year: input.planted_year ?? null,
+    planted_year: input.planted_year && null,
     quantity: input.quantity ?? null,
     height_cm: input.height_cm ?? null,

[Survived] LogicalOperator
src/lib/bed-plants.ts:82:15
     user_id: userId,
     name: input.name,
     planted_year: input.planted_year ?? null,
-    quantity: input.quantity ?? null,
+    quantity: input.quantity && null,
     height_cm: input.height_cm ?? null,
     width_cm: input.width_cm ?? null,

[Survived] LogicalOperator
src/lib/bed-plants.ts:83:16
     name: input.name,
     planted_year: input.planted_year ?? null,
     quantity: input.quantity ?? null,
-    height_cm: input.height_cm ?? null,
+    height_cm: input.height_cm && null,
     width_cm: input.width_cm ?? null,
   };

[Survived] LogicalOperator
src/lib/bed-plants.ts:84:15
     planted_year: input.planted_year ?? null,
     quantity: input.quantity ?? null,
     height_cm: input.height_cm ?? null,
-    width_cm: input.width_cm ?? null,
+    width_cm: input.width_cm && null,
   };
 }

[Survived] BlockStatement
src/lib/bed-plants.ts:88:72
   };
 }
 
-export function toBedPlantResponse(row: BedPlantRow): BedPlantResponse {
-  const { user_id: _userId, ...response } = row;
-  return response;
-}
+export function toBedPlantResponse(row: BedPlantRow): BedPlantResponse {}
 
 function isRecord(value: unknown): value is Record<string, unknown> {

[Survived] BlockStatement
src/lib/bed-plants.ts:93:69
   return response;
 }
 
-function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
-}
+function isRecord(value: unknown): value is Record<string, unknown> {}
 
 type NumberCheck = (value: number) => boolean;

[Survived] ConditionalExpression
src/lib/bed-plants.ts:94:10
 }
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return true;
 }
 

[Survived] ConditionalExpression
src/lib/bed-plants.ts:94:10
 }
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return true && !Array.isArray(value);
 }
 

[Survived] BlockStatement
src/lib/bed-plants.ts:106:25
   key: string,
   error: string,
   check: NumberCheck,
-): OptionalNumberResult {
-  const value = source[key];
-
-  if (value === undefined || value === null) {
-    return { success: true, value: null };
-  }
-
-  if (typeof value !== "number" || !Number.isFinite(value) || !check(value)) {
-    return { success: false, error };
-  }
-
-  return { success: true, value };
-}
+): OptionalNumberResult {}
 
 function isValidPlantedYear(value: number): boolean {

[Survived] ConditionalExpression
src/lib/bed-plants.ts:109:7
 ): OptionalNumberResult {
   const value = source[key];
 
-  if (value === undefined || value === null) {
+  if (true) {
     return { success: true, value: null };
   }

[Survived] LogicalOperator
src/lib/bed-plants.ts:109:7
 ): OptionalNumberResult {
   const value = source[key];
 
-  if (value === undefined || value === null) {
+  if (value === undefined && value === null) {
     return { success: true, value: null };
   }

[Survived] BooleanLiteral
src/lib/bed-plants.ts:110:23
   const value = source[key];
 
   if (value === undefined || value === null) {
-    return { success: true, value: null };
+    return { success: false, value: null };
   }
 

[Survived] ObjectLiteral
src/lib/bed-plants.ts:110:12
   const value = source[key];
 
   if (value === undefined || value === null) {
-    return { success: true, value: null };
+    return {};
   }
 

[Survived] LogicalOperator
src/lib/bed-plants.ts:113:7
     return { success: true, value: null };
   }
 
-  if (typeof value !== "number" || !Number.isFinite(value) || !check(value)) {
+  if ((typeof value !== "number" || !Number.isFinite(value)) && !check(value)) {
     return { success: false, error };
   }

[Survived] BooleanLiteral
src/lib/bed-plants.ts:113:36
     return { success: true, value: null };
   }
 
-  if (typeof value !== "number" || !Number.isFinite(value) || !check(value)) {
+  if (typeof value !== "number" || Number.isFinite(value) || !check(value)) {
     return { success: false, error };
   }

[Survived] BooleanLiteral
src/lib/bed-plants.ts:114:23
   }
 
   if (typeof value !== "number" || !Number.isFinite(value) || !check(value)) {
-    return { success: false, error };
+    return { success: true, error };
   }
 

[Survived] BooleanLiteral
src/lib/bed-plants.ts:117:21
     return { success: false, error };
   }
 
-  return { success: true, value };
+  return { success: false, value };
 }
 

[Survived] BlockStatement
src/lib/bed-plants.ts:120:53
   return { success: true, value };
 }
 
-function isValidPlantedYear(value: number): boolean {
-  return Number.isInteger(value) && value >= MIN_PLANTED_YEAR && value <= new Date().getFullYear();
-}
+function isValidPlantedYear(value: number): boolean {}
 
 function isPositiveInteger(value: number): boolean {

[Survived] ConditionalExpression
src/lib/bed-plants.ts:121:10
 }
 
 function isValidPlantedYear(value: number): boolean {
-  return Number.isInteger(value) && value >= MIN_PLANTED_YEAR && value <= new Date().getFullYear();
+  return false;
 }
 

[Survived] LogicalOperator
src/lib/bed-plants.ts:121:10
 }
 
 function isValidPlantedYear(value: number): boolean {
-  return Number.isInteger(value) && value >= MIN_PLANTED_YEAR && value <= new Date().getFullYear();
+  return Number.isInteger(value) || value >= MIN_PLANTED_YEAR && value <= new Date().getFullYear();
 }
 

[Survived] BlockStatement
src/lib/bed-plants.ts:124:52
   return Number.isInteger(value) && value >= MIN_PLANTED_YEAR && value <= new Date().getFullYear();
 }
 
-function isPositiveInteger(value: number): boolean {
-  return Number.isInteger(value) && value > 0;
-}
+function isPositiveInteger(value: number): boolean {}
 
 function isPositiveNumber(value: number): boolean {

[Survived] ConditionalExpression
src/lib/bed-plants.ts:125:37
 }
 
 function isPositiveInteger(value: number): boolean {
-  return Number.isInteger(value) && value > 0;
+  return Number.isInteger(value) && true;
 }
 

[Survived] LogicalOperator
src/lib/bed-plants.ts:125:10
 }
 
 function isPositiveInteger(value: number): boolean {
-  return Number.isInteger(value) && value > 0;
+  return Number.isInteger(value) || value > 0;
 }
 

[Survived] BlockStatement
src/lib/bed-plants.ts:128:51
   return Number.isInteger(value) && value > 0;
 }
 
-function isPositiveNumber(value: number): boolean {
-  return value > 0;
-}
+function isPositiveNumber(value: number): boolean {}
 

[Survived] EqualityOperator
src/lib/bed-plants.ts:129:10
 }
 
 function isPositiveNumber(value: number): boolean {
-  return value > 0;
+  return value >= 0;
 }
 

[Survived] ConditionalExpression
src/lib/bed-plants.ts:129:10
 }
 
 function isPositiveNumber(value: number): boolean {
-  return value > 0;
+  return false;
 }
 
