[Killed] ArithmeticOperator
src/lib/garden-beds.ts:138:16
   urgent: 3,
 } as const;
 
-const DAY_MS = 24 * 60 * 60 * 1000;
+const DAY_MS = 24 * 60 * 60 / 1000;
 const OBSERVATION_DECAY_DAYS = 60;
 const MAX_OBSERVATION_PRESSURE_SCORE = 80;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArithmeticOperator
src/lib/garden-beds.ts:138:16
   urgent: 3,
 } as const;
 
-const DAY_MS = 24 * 60 * 60 * 1000;
+const DAY_MS = 24 / 60 * 60 * 1000;
 const OBSERVATION_DECAY_DAYS = 60;
 const MAX_OBSERVATION_PRESSURE_SCORE = 80;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BooleanLiteral
src/lib/garden-beds.ts:163:7
 } as const;
 
 export function validateCreateGardenBedInput(value: unknown): GardenBedValidationResult {
-  if (!isRecord(value)) {
+  if (isRecord(value)) {
     return { success: false, error: "Garden bed payload must be an object." };
   }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:163:7
 } as const;
 
 export function validateCreateGardenBedInput(value: unknown): GardenBedValidationResult {
-  if (!isRecord(value)) {
+  if (true) {
     return { success: false, error: "Garden bed payload must be an object." };
   }

[Survived] BooleanLiteral
src/lib/garden-beds.ts:164:23
 
 export function validateCreateGardenBedInput(value: unknown): GardenBedValidationResult {
   if (!isRecord(value)) {
-    return { success: false, error: "Garden bed payload must be an object." };
+    return { success: true, error: "Garden bed payload must be an object." };
   }
 

[Survived] EqualityOperator
src/lib/garden-beds.ts:168:35
   }
 
   const name = value.name;
-  if (typeof name !== "string" || name.trim().length === 0) {
+  if (typeof name !== "string" || name.trim().length !== 0) {
     return { success: false, error: "Garden bed name is required." };
   }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:168:7
   }
 
   const name = value.name;
-  if (typeof name !== "string" || name.trim().length === 0) {
+  if (false) {
     return { success: false, error: "Garden bed name is required." };
   }

[Survived] BooleanLiteral
src/lib/garden-beds.ts:169:23
 
   const name = value.name;
   if (typeof name !== "string" || name.trim().length === 0) {
-    return { success: false, error: "Garden bed name is required." };
+    return { success: true, error: "Garden bed name is required." };
   }
 

[Survived] StringLiteral
src/lib/garden-beds.ts:169:37
 
   const name = value.name;
   if (typeof name !== "string" || name.trim().length === 0) {
-    return { success: false, error: "Garden bed name is required." };
+    return { success: false, error: "" };
   }
 

[Survived] ConditionalExpression
src/lib/garden-beds.ts:173:7
   }
 
   const weedLevel = value.weed_level;
-  if (!isWeedLevel(weedLevel)) {
+  if (true) {
     return { success: false, error: "Weed level must be low, medium, or high." };
   }

[Survived] BlockStatement
src/lib/garden-beds.ts:173:32
   }
 
   const weedLevel = value.weed_level;
-  if (!isWeedLevel(weedLevel)) {
-    return { success: false, error: "Weed level must be low, medium, or high." };
-  }
+  if (!isWeedLevel(weedLevel)) {}
 
   const area = readOptionalNumber(value, "area_m2", "Area must be a positive number.", isPositiveNumber);

[Survived] BooleanLiteral
src/lib/garden-beds.ts:174:23
 
   const weedLevel = value.weed_level;
   if (!isWeedLevel(weedLevel)) {
-    return { success: false, error: "Weed level must be low, medium, or high." };
+    return { success: true, error: "Weed level must be low, medium, or high." };
   }
 

[Survived] ConditionalExpression
src/lib/garden-beds.ts:178:7
   }
 
   const area = readOptionalNumber(value, "area_m2", "Area must be a positive number.", isPositiveNumber);
-  if (!area.success) return area;
+  if (false) return area;
 
   const estimatedMinutes = readOptionalNumber(

[Survived] ConditionalExpression
src/lib/garden-beds.ts:178:7
   }
 
   const area = readOptionalNumber(value, "area_m2", "Area must be a positive number.", isPositiveNumber);
-  if (!area.success) return area;
+  if (true) return area;
 
   const estimatedMinutes = readOptionalNumber(

[Survived] StringLiteral
src/lib/garden-beds.ts:182:5
 
   const estimatedMinutes = readOptionalNumber(
     value,
-    "estimated_minutes",
+    "",
     "Estimated minutes must be a positive integer.",
     isPositiveInteger,

[Survived] ConditionalExpression
src/lib/garden-beds.ts:186:7
     "Estimated minutes must be a positive integer.",
     isPositiveInteger,
   );
-  if (!estimatedMinutes.success) return estimatedMinutes;
+  if (true) return estimatedMinutes;
 
   const mulchDepth = readOptionalNumber(

[Survived] BooleanLiteral
src/lib/garden-beds.ts:186:7
     "Estimated minutes must be a positive integer.",
     isPositiveInteger,
   );
-  if (!estimatedMinutes.success) return estimatedMinutes;
+  if (estimatedMinutes.success) return estimatedMinutes;
 
   const mulchDepth = readOptionalNumber(

[Survived] ConditionalExpression
src/lib/garden-beds.ts:194:7
     "Mulch depth must be a non-negative number.",
     isNonNegativeNumber,
   );
-  if (!mulchDepth.success) return mulchDepth;
+  if (false) return mulchDepth;
 
   const lastWeededAt = value.last_weeded_at;

[Survived] BooleanLiteral
src/lib/garden-beds.ts:194:7
     "Mulch depth must be a non-negative number.",
     isNonNegativeNumber,
   );
-  if (!mulchDepth.success) return mulchDepth;
+  if (mulchDepth.success) return mulchDepth;
 
   const lastWeededAt = value.last_weeded_at;

[Survived] EqualityOperator
src/lib/garden-beds.ts:197:7
   if (!mulchDepth.success) return mulchDepth;
 
   const lastWeededAt = value.last_weeded_at;
-  if (lastWeededAt !== undefined && lastWeededAt !== null) {
+  if (lastWeededAt === undefined && lastWeededAt !== null) {
     if (typeof lastWeededAt !== "string" || !isValidIsoDate(lastWeededAt)) {
       return { success: false, error: "Last weeded date must be a valid YYYY-MM-DD date." };

[Survived] ConditionalExpression
src/lib/garden-beds.ts:197:37
   if (!mulchDepth.success) return mulchDepth;
 
   const lastWeededAt = value.last_weeded_at;
-  if (lastWeededAt !== undefined && lastWeededAt !== null) {
+  if (lastWeededAt !== undefined && true) {
     if (typeof lastWeededAt !== "string" || !isValidIsoDate(lastWeededAt)) {
       return { success: false, error: "Last weeded date must be a valid YYYY-MM-DD date." };

[Survived] ConditionalExpression
src/lib/garden-beds.ts:198:9
 
   const lastWeededAt = value.last_weeded_at;
   if (lastWeededAt !== undefined && lastWeededAt !== null) {
-    if (typeof lastWeededAt !== "string" || !isValidIsoDate(lastWeededAt)) {
+    if (true) {
       return { success: false, error: "Last weeded date must be a valid YYYY-MM-DD date." };
     }

[Survived] LogicalOperator
src/lib/garden-beds.ts:198:9
 
   const lastWeededAt = value.last_weeded_at;
   if (lastWeededAt !== undefined && lastWeededAt !== null) {
-    if (typeof lastWeededAt !== "string" || !isValidIsoDate(lastWeededAt)) {
+    if (typeof lastWeededAt !== "string" && !isValidIsoDate(lastWeededAt)) {
       return { success: false, error: "Last weeded date must be a valid YYYY-MM-DD date." };
     }

[Survived] BooleanLiteral
src/lib/garden-beds.ts:199:25
   const lastWeededAt = value.last_weeded_at;
   if (lastWeededAt !== undefined && lastWeededAt !== null) {
     if (typeof lastWeededAt !== "string" || !isValidIsoDate(lastWeededAt)) {
-      return { success: false, error: "Last weeded date must be a valid YYYY-MM-DD date." };
+      return { success: true, error: "Last weeded date must be a valid YYYY-MM-DD date." };
     }
   }

[Survived] ObjectLiteral
src/lib/garden-beds.ts:199:14
   const lastWeededAt = value.last_weeded_at;
   if (lastWeededAt !== undefined && lastWeededAt !== null) {
     if (typeof lastWeededAt !== "string" || !isValidIsoDate(lastWeededAt)) {
-      return { success: false, error: "Last weeded date must be a valid YYYY-MM-DD date." };
+      return {};
     }
   }

[Survived] ObjectLiteral
src/lib/garden-beds.ts:203:10
     }
   }
 
-  return {
-    success: true,
-    data: {
-      name: name.trim(),
-      weed_level: weedLevel,
-      area_m2: area.value,
-      last_weeded_at: lastWeededAt ?? null,
-      estimated_minutes: estimatedMinutes.value,
-      mulch_depth_cm: mulchDepth.value,
-    },
-  };
+  return {};
 }
 

[Survived] LogicalOperator
src/lib/garden-beds.ts:209:23
       name: name.trim(),
       weed_level: weedLevel,
       area_m2: area.value,
-      last_weeded_at: lastWeededAt ?? null,
+      last_weeded_at: lastWeededAt && null,
       estimated_minutes: estimatedMinutes.value,
       mulch_depth_cm: mulchDepth.value,

[Survived] BlockStatement
src/lib/garden-beds.ts:216:111
   };
 }
 
-export function toGardenBedInsertPayload(input: CreateGardenBedInput, userId: string): GardenBedInsertPayload {
-  return {
-    user_id: userId,
-    name: input.name,
-    weed_level: input.weed_level,
-    area_m2: input.area_m2 ?? null,
-    last_weeded_at: input.last_weeded_at ?? null,
-    estimated_minutes: input.estimated_minutes ?? null,
-    mulch_depth_cm: input.mulch_depth_cm ?? null,
-  };
-}
+export function toGardenBedInsertPayload(input: CreateGardenBedInput, userId: string): GardenBedInsertPayload {}
 
 export function toGardenBedResponse(row: GardenBedRow): GardenBedResponse {

[Survived] LogicalOperator
src/lib/garden-beds.ts:221:14
     user_id: userId,
     name: input.name,
     weed_level: input.weed_level,
-    area_m2: input.area_m2 ?? null,
+    area_m2: input.area_m2 && null,
     last_weeded_at: input.last_weeded_at ?? null,
     estimated_minutes: input.estimated_minutes ?? null,

[Survived] LogicalOperator
src/lib/garden-beds.ts:222:21
     name: input.name,
     weed_level: input.weed_level,
     area_m2: input.area_m2 ?? null,
-    last_weeded_at: input.last_weeded_at ?? null,
+    last_weeded_at: input.last_weeded_at && null,
     estimated_minutes: input.estimated_minutes ?? null,
     mulch_depth_cm: input.mulch_depth_cm ?? null,

[Survived] LogicalOperator
src/lib/garden-beds.ts:223:24
     weed_level: input.weed_level,
     area_m2: input.area_m2 ?? null,
     last_weeded_at: input.last_weeded_at ?? null,
-    estimated_minutes: input.estimated_minutes ?? null,
+    estimated_minutes: input.estimated_minutes && null,
     mulch_depth_cm: input.mulch_depth_cm ?? null,
   };

[Survived] LogicalOperator
src/lib/garden-beds.ts:224:21
     area_m2: input.area_m2 ?? null,
     last_weeded_at: input.last_weeded_at ?? null,
     estimated_minutes: input.estimated_minutes ?? null,
-    mulch_depth_cm: input.mulch_depth_cm ?? null,
+    mulch_depth_cm: input.mulch_depth_cm && null,
   };
 }

[Survived] BlockStatement
src/lib/garden-beds.ts:228:75
   };
 }
 
-export function toGardenBedResponse(row: GardenBedRow): GardenBedResponse {
-  const { user_id: _userId, ...response } = row;
-  return response;
-}
+export function toGardenBedResponse(row: GardenBedRow): GardenBedResponse {}
 
 export function getSuggestedWeedAt(

[Killed] BlockStatement
src/lib/garden-beds.ts:237:18
   lastWeededAt: string | null,
   weedLevel: WeedLevel,
   observationSummary: GardenBedObservationSummary = NO_OBSERVATION_SUMMARY,
-): string | null {
-  const pressure = observationSummary.observation_pressure_score;
-  const adjustedIntervalDays = adjustSuggestedIntervalDays(SUGGESTED_WEED_INTERVAL_DAYS[weedLevel], pressure);
-
-  const candidates: string[] = [];
-  if (lastWeededAt) {
-    const lastWeededDate = parseIsoDate(lastWeededAt);
-    if (lastWeededDate) {
-      candidates.push(addDays(lastWeededDate, adjustedIntervalDays));
-    }
-  }
-
-  const responseWindow = getObservationResponseWindowDays(pressure);
-  if (responseWindow !== null && observationSummary.latest_observed_at) {
-    const latestObservedDate = parseIsoDate(observationSummary.latest_observed_at);
-    if (latestObservedDate) {
-      candidates.push(addDays(latestObservedDate, responseWindow));
-    }
-  }
-
-  if (candidates.length === 0) return null;
-  return candidates.sort()[0] ?? null;
-}
+): string | null {}
 
 export function getGardenBedPriority(
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:242:7
   const adjustedIntervalDays = adjustSuggestedIntervalDays(SUGGESTED_WEED_INTERVAL_DAYS[weedLevel], pressure);
 
   const candidates: string[] = [];
-  if (lastWeededAt) {
+  if (false) {
     const lastWeededDate = parseIsoDate(lastWeededAt);
     if (lastWeededDate) {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:242:21
   const adjustedIntervalDays = adjustSuggestedIntervalDays(SUGGESTED_WEED_INTERVAL_DAYS[weedLevel], pressure);
 
   const candidates: string[] = [];
-  if (lastWeededAt) {
-    const lastWeededDate = parseIsoDate(lastWeededAt);
-    if (lastWeededDate) {
-      candidates.push(addDays(lastWeededDate, adjustedIntervalDays));
-    }
-  }
+  if (lastWeededAt) {}
 
   const responseWindow = getObservationResponseWindowDays(pressure);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:244:9
   const candidates: string[] = [];
   if (lastWeededAt) {
     const lastWeededDate = parseIsoDate(lastWeededAt);
-    if (lastWeededDate) {
+    if (false) {
       candidates.push(addDays(lastWeededDate, adjustedIntervalDays));
     }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:244:25
   const candidates: string[] = [];
   if (lastWeededAt) {
     const lastWeededDate = parseIsoDate(lastWeededAt);
-    if (lastWeededDate) {
-      candidates.push(addDays(lastWeededDate, adjustedIntervalDays));
-    }
+    if (lastWeededDate) {}
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] LogicalOperator
src/lib/garden-beds.ts:250:7
   }
 
   const responseWindow = getObservationResponseWindowDays(pressure);
-  if (responseWindow !== null && observationSummary.latest_observed_at) {
+  if (responseWindow !== null || observationSummary.latest_observed_at) {
     const latestObservedDate = parseIsoDate(observationSummary.latest_observed_at);
     if (latestObservedDate) {

[Survived] EqualityOperator
src/lib/garden-beds.ts:250:7
   }
 
   const responseWindow = getObservationResponseWindowDays(pressure);
-  if (responseWindow !== null && observationSummary.latest_observed_at) {
+  if (responseWindow === null && observationSummary.latest_observed_at) {
     const latestObservedDate = parseIsoDate(observationSummary.latest_observed_at);
     if (latestObservedDate) {

[Survived] ConditionalExpression
src/lib/garden-beds.ts:252:9
   const responseWindow = getObservationResponseWindowDays(pressure);
   if (responseWindow !== null && observationSummary.latest_observed_at) {
     const latestObservedDate = parseIsoDate(observationSummary.latest_observed_at);
-    if (latestObservedDate) {
+    if (false) {
       candidates.push(addDays(latestObservedDate, responseWindow));
     }

[Survived] BlockStatement
src/lib/garden-beds.ts:252:29
   const responseWindow = getObservationResponseWindowDays(pressure);
   if (responseWindow !== null && observationSummary.latest_observed_at) {
     const latestObservedDate = parseIsoDate(observationSummary.latest_observed_at);
-    if (latestObservedDate) {
-      candidates.push(addDays(latestObservedDate, responseWindow));
-    }
+    if (latestObservedDate) {}
   }
 

[Killed] EqualityOperator
src/lib/garden-beds.ts:257:7
     }
   }
 
-  if (candidates.length === 0) return null;
+  if (candidates.length !== 0) return null;
   return candidates.sort()[0] ?? null;
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:257:7
     }
   }
 
-  if (candidates.length === 0) return null;
+  if (true) return null;
   return candidates.sort()[0] ?? null;
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] LogicalOperator
src/lib/garden-beds.ts:258:10
   }
 
   if (candidates.length === 0) return null;
-  return candidates.sort()[0] ?? null;
+  return candidates.sort()[0] && null;
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] MethodExpression
src/lib/garden-beds.ts:258:10
   }
 
   if (candidates.length === 0) return null;
-  return candidates.sort()[0] ?? null;
+  return candidates[0] ?? null;
 }
 

[Killed] BlockStatement
src/lib/garden-beds.ts:264:28
 export function getGardenBedPriority(
   bed: GardenBedResponse | GardenBedRow,
   observationSummary: GardenBedObservationSummary = NO_OBSERVATION_SUMMARY,
-): GardenBedPriorityResult {
-  const score = calculatePriorityScore(bed, observationSummary);
-  const priority = getPriorityFromScore(score);
-
-  return {
-    priority,
-    priority_label: BED_QUEUE_PRIORITY_LABELS[priority],
-    priority_score: score,
-    suggested_weed_at: getSuggestedWeedAt(bed.last_weeded_at, bed.weed_level, observationSummary),
-    priority_confidence: hasCompletePriorityInputs(bed) ? "complete" : "partial",
-    observation_pressure_score: observationSummary.observation_pressure_score,
-    observation_pressure_label: observationSummary.observation_pressure_label,
-    observation_count: observationSummary.observation_count,
-    observation_reasons: observationSummary.observation_reasons,
-  };
-}
+): GardenBedPriorityResult {}
 
 export function toGardenBedQueueItem(
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] StringLiteral
src/lib/garden-beds.ts:273:59
     priority_label: BED_QUEUE_PRIORITY_LABELS[priority],
     priority_score: score,
     suggested_weed_at: getSuggestedWeedAt(bed.last_weeded_at, bed.weed_level, observationSummary),
-    priority_confidence: hasCompletePriorityInputs(bed) ? "complete" : "partial",
+    priority_confidence: hasCompletePriorityInputs(bed) ? "" : "partial",
     observation_pressure_score: observationSummary.observation_pressure_score,
     observation_pressure_label: observationSummary.observation_pressure_label,

[Killed] BlockStatement
src/lib/garden-beds.ts:284:23
 export function toGardenBedQueueItem(
   bed: GardenBedResponse | GardenBedRow,
   observationSummary: GardenBedObservationSummary = NO_OBSERVATION_SUMMARY,
-): GardenBedQueueItem {
-  return {
-    ...toGardenBedResponseLike(bed),
-    ...getGardenBedPriority(bed, observationSummary),
-  };
-}
+): GardenBedQueueItem {}
 
 export function toSortedGardenBedQueue(
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ObjectLiteral
src/lib/garden-beds.ts:285:10
   bed: GardenBedResponse | GardenBedRow,
   observationSummary: GardenBedObservationSummary = NO_OBSERVATION_SUMMARY,
 ): GardenBedQueueItem {
-  return {
-    ...toGardenBedResponseLike(bed),
-    ...getGardenBedPriority(bed, observationSummary),
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:294:25
 export function toSortedGardenBedQueue(
   beds: readonly (GardenBedResponse | GardenBedRow)[],
   observationSummaries?: GardenBedObservationSummaryMap,
-): GardenBedQueueItem[] {
-  return beds
-    .map((bed) => toGardenBedQueueItem(bed, observationSummaries?.get(bed.id) ?? NO_OBSERVATION_SUMMARY))
-    .sort(compareGardenBedQueueItems);
-}
+): GardenBedQueueItem[] {}
 
 export function summarizeGardenBedObservationPressure(
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] MethodExpression
src/lib/garden-beds.ts:295:10
   beds: readonly (GardenBedResponse | GardenBedRow)[],
   observationSummaries?: GardenBedObservationSummaryMap,
 ): GardenBedQueueItem[] {
-  return beds
-    .map((bed) => toGardenBedQueueItem(bed, observationSummaries?.get(bed.id) ?? NO_OBSERVATION_SUMMARY))
-    .sort(compareGardenBedQueueItems);
+  return beds.map(bed => toGardenBedQueueItem(bed, observationSummaries?.get(bed.id) ?? NO_OBSERVATION_SUMMARY));
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArrowFunction
src/lib/garden-beds.ts:296:10
   observationSummaries?: GardenBedObservationSummaryMap,
 ): GardenBedQueueItem[] {
   return beds
-    .map((bed) => toGardenBedQueueItem(bed, observationSummaries?.get(bed.id) ?? NO_OBSERVATION_SUMMARY))
+    .map(() => undefined)
     .sort(compareGardenBedQueueItems);
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] OptionalChaining
src/lib/garden-beds.ts:296:45
   observationSummaries?: GardenBedObservationSummaryMap,
 ): GardenBedQueueItem[] {
   return beds
-    .map((bed) => toGardenBedQueueItem(bed, observationSummaries?.get(bed.id) ?? NO_OBSERVATION_SUMMARY))
+    .map((bed) => toGardenBedQueueItem(bed, observationSummaries.get(bed.id) ?? NO_OBSERVATION_SUMMARY))
     .sort(compareGardenBedQueueItems);
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] MethodExpression
src/lib/garden-beds.ts:304:30
   observations: readonly WeedObservationPriorityInput[],
 ): GardenBedObservationSummary {
   const today = startOfUtcToday();
-  const recentObservations = observations
-    .map((observation) => ({ observation, ageDays: getObservationAgeDays(observation.observed_at, today) }))
-    .filter(({ ageDays }) => ageDays !== null && ageDays >= 0 && ageDays <= OBSERVATION_DECAY_DAYS);
+  const recentObservations = observations.map(observation => ({
+  observation,
+  ageDays: getObservationAgeDays(observation.observed_at, today)
+}));
 
   if (recentObservations.length === 0) return NO_OBSERVATION_SUMMARY;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArrowFunction
src/lib/garden-beds.ts:305:10
 ): GardenBedObservationSummary {
   const today = startOfUtcToday();
   const recentObservations = observations
-    .map((observation) => ({ observation, ageDays: getObservationAgeDays(observation.observed_at, today) }))
+    .map(() => undefined)
     .filter(({ ageDays }) => ageDays !== null && ageDays >= 0 && ageDays <= OBSERVATION_DECAY_DAYS);
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ObjectLiteral
src/lib/garden-beds.ts:305:28
 ): GardenBedObservationSummary {
   const today = startOfUtcToday();
   const recentObservations = observations
-    .map((observation) => ({ observation, ageDays: getObservationAgeDays(observation.observed_at, today) }))
+    .map((observation) => ({}))
     .filter(({ ageDays }) => ageDays !== null && ageDays >= 0 && ageDays <= OBSERVATION_DECAY_DAYS);
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:306:30
   const today = startOfUtcToday();
   const recentObservations = observations
     .map((observation) => ({ observation, ageDays: getObservationAgeDays(observation.observed_at, today) }))
-    .filter(({ ageDays }) => ageDays !== null && ageDays >= 0 && ageDays <= OBSERVATION_DECAY_DAYS);
+    .filter(({ ageDays }) => true);
 
   if (recentObservations.length === 0) return NO_OBSERVATION_SUMMARY;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:306:66
   const today = startOfUtcToday();
   const recentObservations = observations
     .map((observation) => ({ observation, ageDays: getObservationAgeDays(observation.observed_at, today) }))
-    .filter(({ ageDays }) => ageDays !== null && ageDays >= 0 && ageDays <= OBSERVATION_DECAY_DAYS);
+    .filter(({ ageDays }) => ageDays !== null && ageDays >= 0 && ageDays > OBSERVATION_DECAY_DAYS);
 
   if (recentObservations.length === 0) return NO_OBSERVATION_SUMMARY;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:308:7
     .map((observation) => ({ observation, ageDays: getObservationAgeDays(observation.observed_at, today) }))
     .filter(({ ageDays }) => ageDays !== null && ageDays >= 0 && ageDays <= OBSERVATION_DECAY_DAYS);
 
-  if (recentObservations.length === 0) return NO_OBSERVATION_SUMMARY;
+  if (recentObservations.length !== 0) return NO_OBSERVATION_SUMMARY;
 
   let maxWeightedScore = 0;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:308:7
     .map((observation) => ({ observation, ageDays: getObservationAgeDays(observation.observed_at, today) }))
     .filter(({ ageDays }) => ageDays !== null && ageDays >= 0 && ageDays <= OBSERVATION_DECAY_DAYS);
 
-  if (recentObservations.length === 0) return NO_OBSERVATION_SUMMARY;
+  if (true) return NO_OBSERVATION_SUMMARY;
 
   let maxWeightedScore = 0;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:314:62
   let latestObservedAt: string | null = null;
   const reasonScores = new Map<string, number>();
 
-  for (const { observation, ageDays } of recentObservations) {
-    const rawScore = getRawObservationScore(observation, reasonScores);
-    const recencyFactor = Math.max(0, 1 - ageDays / OBSERVATION_DECAY_DAYS);
-    maxWeightedScore = Math.max(maxWeightedScore, rawScore * recencyFactor);
-
-    if (latestObservedAt === null || observation.observed_at > latestObservedAt) {
-      latestObservedAt = observation.observed_at;
-    }
-  }
+  for (const { observation, ageDays } of recentObservations) {}
 
   const repeatPressureBonus = Math.min(15, Math.max(0, recentObservations.length - 1) * 5);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArithmeticOperator
src/lib/garden-beds.ts:316:43
 
   for (const { observation, ageDays } of recentObservations) {
     const rawScore = getRawObservationScore(observation, reasonScores);
-    const recencyFactor = Math.max(0, 1 - ageDays / OBSERVATION_DECAY_DAYS);
+    const recencyFactor = Math.max(0, 1 - ageDays * OBSERVATION_DECAY_DAYS);
     maxWeightedScore = Math.max(maxWeightedScore, rawScore * recencyFactor);
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] MethodExpression
src/lib/garden-beds.ts:316:27
 
   for (const { observation, ageDays } of recentObservations) {
     const rawScore = getRawObservationScore(observation, reasonScores);
-    const recencyFactor = Math.max(0, 1 - ageDays / OBSERVATION_DECAY_DAYS);
+    const recencyFactor = Math.min(0, 1 - ageDays / OBSERVATION_DECAY_DAYS);
     maxWeightedScore = Math.max(maxWeightedScore, rawScore * recencyFactor);
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL
