[Killed] MethodExpression
src/lib/garden-beds.ts:317:24
   for (const { observation, ageDays } of recentObservations) {
     const rawScore = getRawObservationScore(observation, reasonScores);
     const recencyFactor = Math.max(0, 1 - ageDays / OBSERVATION_DECAY_DAYS);
-    maxWeightedScore = Math.max(maxWeightedScore, rawScore * recencyFactor);
+    maxWeightedScore = Math.min(maxWeightedScore, rawScore * recencyFactor);
 
     if (latestObservedAt === null || observation.observed_at > latestObservedAt) {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:317:51
   for (const { observation, ageDays } of recentObservations) {
     const rawScore = getRawObservationScore(observation, reasonScores);
     const recencyFactor = Math.max(0, 1 - ageDays / OBSERVATION_DECAY_DAYS);
-    maxWeightedScore = Math.max(maxWeightedScore, rawScore * recencyFactor);
+    maxWeightedScore = Math.max(maxWeightedScore, rawScore / recencyFactor);
 
     if (latestObservedAt === null || observation.observed_at > latestObservedAt) {

[Killed] ConditionalExpression
src/lib/garden-beds.ts:319:9
     const recencyFactor = Math.max(0, 1 - ageDays / OBSERVATION_DECAY_DAYS);
     maxWeightedScore = Math.max(maxWeightedScore, rawScore * recencyFactor);
 
-    if (latestObservedAt === null || observation.observed_at > latestObservedAt) {
+    if (true) {
       latestObservedAt = observation.observed_at;
     }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:319:82
     const recencyFactor = Math.max(0, 1 - ageDays / OBSERVATION_DECAY_DAYS);
     maxWeightedScore = Math.max(maxWeightedScore, rawScore * recencyFactor);
 
-    if (latestObservedAt === null || observation.observed_at > latestObservedAt) {
-      latestObservedAt = observation.observed_at;
-    }
+    if (latestObservedAt === null || observation.observed_at > latestObservedAt) {}
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:324:44
     }
   }
 
-  const repeatPressureBonus = Math.min(15, Math.max(0, recentObservations.length - 1) * 5);
+  const repeatPressureBonus = Math.min(15, Math.max(0, recentObservations.length - 1) / 5);
   const pressureScore = Math.min(MAX_OBSERVATION_PRESSURE_SCORE, Math.round(maxWeightedScore + repeatPressureBonus));
 

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:324:56
     }
   }
 
-  const repeatPressureBonus = Math.min(15, Math.max(0, recentObservations.length - 1) * 5);
+  const repeatPressureBonus = Math.min(15, Math.max(0, recentObservations.length + 1) * 5);
   const pressureScore = Math.min(MAX_OBSERVATION_PRESSURE_SCORE, Math.round(maxWeightedScore + repeatPressureBonus));
 

[Survived] MethodExpression
src/lib/garden-beds.ts:325:25
   }
 
   const repeatPressureBonus = Math.min(15, Math.max(0, recentObservations.length - 1) * 5);
-  const pressureScore = Math.min(MAX_OBSERVATION_PRESSURE_SCORE, Math.round(maxWeightedScore + repeatPressureBonus));
+  const pressureScore = Math.max(MAX_OBSERVATION_PRESSURE_SCORE, Math.round(maxWeightedScore + repeatPressureBonus));
 
   return {

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:325:77
   }
 
   const repeatPressureBonus = Math.min(15, Math.max(0, recentObservations.length - 1) * 5);
-  const pressureScore = Math.min(MAX_OBSERVATION_PRESSURE_SCORE, Math.round(maxWeightedScore + repeatPressureBonus));
+  const pressureScore = Math.min(MAX_OBSERVATION_PRESSURE_SCORE, Math.round(maxWeightedScore - repeatPressureBonus));
 
   return {

[Killed] BlockStatement
src/lib/garden-beds.ts:339:11
 function calculatePriorityScore(
   bed: GardenBedResponse | GardenBedRow,
   observationSummary: GardenBedObservationSummary = NO_OBSERVATION_SUMMARY,
-): number {
-  let score = WEED_LEVEL_SCORE[bed.weed_level];
-
-  score += getElapsedDaysScore(bed.last_weeded_at, bed.weed_level);
-  score += getAreaScore(bed.area_m2);
-  score += getEstimatedMinutesScore(bed.estimated_minutes);
-  score += getMulchDepthScore(bed.mulch_depth_cm);
-  score += observationSummary.observation_pressure_score;
-
-  return score;
-}
+): number {}
 
 function getRawObservationScore(observation: WeedObservationPriorityInput, reasonScores: Map<string, number>): number {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] AssignmentOperator
src/lib/garden-beds.ts:342:3
 ): number {
   let score = WEED_LEVEL_SCORE[bed.weed_level];
 
-  score += getElapsedDaysScore(bed.last_weeded_at, bed.weed_level);
+  score -= getElapsedDaysScore(bed.last_weeded_at, bed.weed_level);
   score += getAreaScore(bed.area_m2);
   score += getEstimatedMinutesScore(bed.estimated_minutes);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] AssignmentOperator
src/lib/garden-beds.ts:343:3
   let score = WEED_LEVEL_SCORE[bed.weed_level];
 
   score += getElapsedDaysScore(bed.last_weeded_at, bed.weed_level);
-  score += getAreaScore(bed.area_m2);
+  score -= getAreaScore(bed.area_m2);
   score += getEstimatedMinutesScore(bed.estimated_minutes);
   score += getMulchDepthScore(bed.mulch_depth_cm);

[Survived] AssignmentOperator
src/lib/garden-beds.ts:344:3
 
   score += getElapsedDaysScore(bed.last_weeded_at, bed.weed_level);
   score += getAreaScore(bed.area_m2);
-  score += getEstimatedMinutesScore(bed.estimated_minutes);
+  score -= getEstimatedMinutesScore(bed.estimated_minutes);
   score += getMulchDepthScore(bed.mulch_depth_cm);
   score += observationSummary.observation_pressure_score;

[Survived] AssignmentOperator
src/lib/garden-beds.ts:345:3
   score += getElapsedDaysScore(bed.last_weeded_at, bed.weed_level);
   score += getAreaScore(bed.area_m2);
   score += getEstimatedMinutesScore(bed.estimated_minutes);
-  score += getMulchDepthScore(bed.mulch_depth_cm);
+  score -= getMulchDepthScore(bed.mulch_depth_cm);
   score += observationSummary.observation_pressure_score;
 

[Survived] AssignmentOperator
src/lib/garden-beds.ts:346:3
   score += getAreaScore(bed.area_m2);
   score += getEstimatedMinutesScore(bed.estimated_minutes);
   score += getMulchDepthScore(bed.mulch_depth_cm);
-  score += observationSummary.observation_pressure_score;
+  score -= observationSummary.observation_pressure_score;
 
   return score;

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:352:15
 }
 
 function getRawObservationScore(observation: WeedObservationPriorityInput, reasonScores: Map<string, number>): number {
-  let score = observation.severity * 6;
+  let score = observation.severity / 6;
 
   score += addReasonScore(reasonScores, getCoverageReason(observation.coverage), COVERAGE_SCORE[observation.coverage]);

[Survived] AssignmentOperator
src/lib/garden-beds.ts:354:3
 function getRawObservationScore(observation: WeedObservationPriorityInput, reasonScores: Map<string, number>): number {
   let score = observation.severity * 6;
 
-  score += addReasonScore(reasonScores, getCoverageReason(observation.coverage), COVERAGE_SCORE[observation.coverage]);
+  score -= addReasonScore(reasonScores, getCoverageReason(observation.coverage), COVERAGE_SCORE[observation.coverage]);
   score += addReasonScore(
     reasonScores,

[Survived] AssignmentOperator
src/lib/garden-beds.ts:355:3
   let score = observation.severity * 6;
 
   score += addReasonScore(reasonScores, getCoverageReason(observation.coverage), COVERAGE_SCORE[observation.coverage]);
-  score += addReasonScore(
-    reasonScores,
-    getGrowthStageReason(observation.growth_stage),
-    GROWTH_STAGE_SCORE[observation.growth_stage],
-  );
+  score -= addReasonScore(reasonScores, getGrowthStageReason(observation.growth_stage), GROWTH_STAGE_SCORE[observation.growth_stage]);
 
   if (observation.spreads_by_rhizomes) {

[Survived] BlockStatement
src/lib/garden-beds.ts:361:40
     GROWTH_STAGE_SCORE[observation.growth_stage],
   );
 
-  if (observation.spreads_by_rhizomes) {
-    score += addReasonScore(reasonScores, "rozłogi lub kłącza", 20);
-  }
+  if (observation.spreads_by_rhizomes) {}
   if (observation.spreads_by_stolons) {
     score += addReasonScore(reasonScores, "płożące pędy", 20);

[Survived] ConditionalExpression
src/lib/garden-beds.ts:361:7
     GROWTH_STAGE_SCORE[observation.growth_stage],
   );
 
-  if (observation.spreads_by_rhizomes) {
+  if (false) {
     score += addReasonScore(reasonScores, "rozłogi lub kłącza", 20);
   }

[Survived] AssignmentOperator
src/lib/garden-beds.ts:362:5
   );
 
   if (observation.spreads_by_rhizomes) {
-    score += addReasonScore(reasonScores, "rozłogi lub kłącza", 20);
+    score -= addReasonScore(reasonScores, "rozłogi lub kłącza", 20);
   }
   if (observation.spreads_by_stolons) {

[Survived] ConditionalExpression
src/lib/garden-beds.ts:364:7
   if (observation.spreads_by_rhizomes) {
     score += addReasonScore(reasonScores, "rozłogi lub kłącza", 20);
   }
-  if (observation.spreads_by_stolons) {
+  if (false) {
     score += addReasonScore(reasonScores, "płożące pędy", 20);
   }

[Survived] BlockStatement
src/lib/garden-beds.ts:364:39
   if (observation.spreads_by_rhizomes) {
     score += addReasonScore(reasonScores, "rozłogi lub kłącza", 20);
   }
-  if (observation.spreads_by_stolons) {
-    score += addReasonScore(reasonScores, "płożące pędy", 20);
-  }
+  if (observation.spreads_by_stolons) {}
   if (observation.spreads_by_tubers) {
     score += addReasonScore(reasonScores, "bulwy lub rozmnóżki", 25);

[Survived] AssignmentOperator
src/lib/garden-beds.ts:365:5
     score += addReasonScore(reasonScores, "rozłogi lub kłącza", 20);
   }
   if (observation.spreads_by_stolons) {
-    score += addReasonScore(reasonScores, "płożące pędy", 20);
+    score -= addReasonScore(reasonScores, "płożące pędy", 20);
   }
   if (observation.spreads_by_tubers) {

[Survived] StringLiteral
src/lib/garden-beds.ts:365:43
     score += addReasonScore(reasonScores, "rozłogi lub kłącza", 20);
   }
   if (observation.spreads_by_stolons) {
-    score += addReasonScore(reasonScores, "płożące pędy", 20);
+    score += addReasonScore(reasonScores, "", 20);
   }
   if (observation.spreads_by_tubers) {

[Survived] BlockStatement
src/lib/garden-beds.ts:367:38
   if (observation.spreads_by_stolons) {
     score += addReasonScore(reasonScores, "płożące pędy", 20);
   }
-  if (observation.spreads_by_tubers) {
-    score += addReasonScore(reasonScores, "bulwy lub rozmnóżki", 25);
-  }
+  if (observation.spreads_by_tubers) {}
   if (observation.regrows_from_root_fragments) {
     score += addReasonScore(reasonScores, "odrastanie z korzeni", 20);

[Survived] ConditionalExpression
src/lib/garden-beds.ts:367:7
   if (observation.spreads_by_stolons) {
     score += addReasonScore(reasonScores, "płożące pędy", 20);
   }
-  if (observation.spreads_by_tubers) {
+  if (false) {
     score += addReasonScore(reasonScores, "bulwy lub rozmnóżki", 25);
   }

[Survived] AssignmentOperator
src/lib/garden-beds.ts:368:5
     score += addReasonScore(reasonScores, "płożące pędy", 20);
   }
   if (observation.spreads_by_tubers) {
-    score += addReasonScore(reasonScores, "bulwy lub rozmnóżki", 25);
+    score -= addReasonScore(reasonScores, "bulwy lub rozmnóżki", 25);
   }
   if (observation.regrows_from_root_fragments) {

[Survived] StringLiteral
src/lib/garden-beds.ts:368:43
     score += addReasonScore(reasonScores, "płożące pędy", 20);
   }
   if (observation.spreads_by_tubers) {
-    score += addReasonScore(reasonScores, "bulwy lub rozmnóżki", 25);
+    score += addReasonScore(reasonScores, "", 25);
   }
   if (observation.regrows_from_root_fragments) {

[Survived] ConditionalExpression
src/lib/garden-beds.ts:370:7
   if (observation.spreads_by_tubers) {
     score += addReasonScore(reasonScores, "bulwy lub rozmnóżki", 25);
   }
-  if (observation.regrows_from_root_fragments) {
+  if (false) {
     score += addReasonScore(reasonScores, "odrastanie z korzeni", 20);
   }

[Survived] BlockStatement
src/lib/garden-beds.ts:370:48
   if (observation.spreads_by_tubers) {
     score += addReasonScore(reasonScores, "bulwy lub rozmnóżki", 25);
   }
-  if (observation.regrows_from_root_fragments) {
-    score += addReasonScore(reasonScores, "odrastanie z korzeni", 20);
-  }
+  if (observation.regrows_from_root_fragments) {}
   if (observation.prolific_seed_producer) {
     score += addReasonScore(reasonScores, "dużo nasion", 15);

[Survived] AssignmentOperator
src/lib/garden-beds.ts:371:5
     score += addReasonScore(reasonScores, "bulwy lub rozmnóżki", 25);
   }
   if (observation.regrows_from_root_fragments) {
-    score += addReasonScore(reasonScores, "odrastanie z korzeni", 20);
+    score -= addReasonScore(reasonScores, "odrastanie z korzeni", 20);
   }
   if (observation.prolific_seed_producer) {

[Survived] ConditionalExpression
src/lib/garden-beds.ts:373:7
   if (observation.regrows_from_root_fragments) {
     score += addReasonScore(reasonScores, "odrastanie z korzeni", 20);
   }
-  if (observation.prolific_seed_producer) {
+  if (false) {
     score += addReasonScore(reasonScores, "dużo nasion", 15);
   }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:373:7
   if (observation.regrows_from_root_fragments) {
     score += addReasonScore(reasonScores, "odrastanie z korzeni", 20);
   }
-  if (observation.prolific_seed_producer) {
+  if (true) {
     score += addReasonScore(reasonScores, "dużo nasion", 15);
   }

[Survived] AssignmentOperator
src/lib/garden-beds.ts:374:5
     score += addReasonScore(reasonScores, "odrastanie z korzeni", 20);
   }
   if (observation.prolific_seed_producer) {
-    score += addReasonScore(reasonScores, "dużo nasion", 15);
+    score -= addReasonScore(reasonScores, "dużo nasion", 15);
   }
   if (observation.fast_regrowth) {

[Survived] StringLiteral
src/lib/garden-beds.ts:374:43
     score += addReasonScore(reasonScores, "odrastanie z korzeni", 20);
   }
   if (observation.prolific_seed_producer) {
-    score += addReasonScore(reasonScores, "dużo nasion", 15);
+    score += addReasonScore(reasonScores, "", 15);
   }
   if (observation.fast_regrowth) {

[Survived] ConditionalExpression
src/lib/garden-beds.ts:376:7
   if (observation.prolific_seed_producer) {
     score += addReasonScore(reasonScores, "dużo nasion", 15);
   }
-  if (observation.fast_regrowth) {
+  if (true) {
     score += addReasonScore(reasonScores, "szybki odrost", 15);
   }

[Survived] BlockStatement
src/lib/garden-beds.ts:376:34
   if (observation.prolific_seed_producer) {
     score += addReasonScore(reasonScores, "dużo nasion", 15);
   }
-  if (observation.fast_regrowth) {
-    score += addReasonScore(reasonScores, "szybki odrost", 15);
-  }
+  if (observation.fast_regrowth) {}
 
   score += addReasonScore(reasonScores, getSeverityReason(observation.severity), observation.severity * 6);

[Survived] AssignmentOperator
src/lib/garden-beds.ts:377:5
     score += addReasonScore(reasonScores, "dużo nasion", 15);
   }
   if (observation.fast_regrowth) {
-    score += addReasonScore(reasonScores, "szybki odrost", 15);
+    score -= addReasonScore(reasonScores, "szybki odrost", 15);
   }
 

[Killed] AssignmentOperator
src/lib/garden-beds.ts:380:3
     score += addReasonScore(reasonScores, "szybki odrost", 15);
   }
 
-  score += addReasonScore(reasonScores, getSeverityReason(observation.severity), observation.severity * 6);
+  score -= addReasonScore(reasonScores, getSeverityReason(observation.severity), observation.severity * 6);
 
   return score;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:380:82
     score += addReasonScore(reasonScores, "szybki odrost", 15);
   }
 
-  score += addReasonScore(reasonScores, getSeverityReason(observation.severity), observation.severity * 6);
+  score += addReasonScore(reasonScores, getSeverityReason(observation.severity), observation.severity / 6);
 
   return score;

[Killed] BlockStatement
src/lib/garden-beds.ts:385:106
   return score;
 }
 
-function addReasonScore(reasonScores: Map<string, number>, reason: string | null, score: number): number {
-  if (reason && score > 0) {
-    reasonScores.set(reason, (reasonScores.get(reason) ?? 0) + score);
-  }
-  return score;
-}
+function addReasonScore(reasonScores: Map<string, number>, reason: string | null, score: number): number {}
 
 function getSeverityReason(severity: number): string | null {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:386:28
 }
 
 function addReasonScore(reasonScores: Map<string, number>, reason: string | null, score: number): number {
-  if (reason && score > 0) {
-    reasonScores.set(reason, (reasonScores.get(reason) ?? 0) + score);
-  }
+  if (reason && score > 0) {}
   return score;
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:386:17
 }
 
 function addReasonScore(reasonScores: Map<string, number>, reason: string | null, score: number): number {
-  if (reason && score > 0) {
+  if (reason && score <= 0) {
     reasonScores.set(reason, (reasonScores.get(reason) ?? 0) + score);
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArithmeticOperator
src/lib/garden-beds.ts:387:30
 
 function addReasonScore(reasonScores: Map<string, number>, reason: string | null, score: number): number {
   if (reason && score > 0) {
-    reasonScores.set(reason, (reasonScores.get(reason) ?? 0) + score);
+    reasonScores.set(reason, (reasonScores.get(reason) ?? 0) - score);
   }
   return score;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] LogicalOperator
src/lib/garden-beds.ts:387:31
 
 function addReasonScore(reasonScores: Map<string, number>, reason: string | null, score: number): number {
   if (reason && score > 0) {
-    reasonScores.set(reason, (reasonScores.get(reason) ?? 0) + score);
+    reasonScores.set(reason, (reasonScores.get(reason) && 0) + score);
   }
   return score;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BlockStatement
src/lib/garden-beds.ts:392:61
   return score;
 }
 
-function getSeverityReason(severity: number): string | null {
-  if (severity >= 5) return "bardzo wysokie nasilenie";
-  if (severity >= 4) return "wysokie nasilenie";
-  return null;
-}
+function getSeverityReason(severity: number): string | null {}
 
 function getCoverageReason(coverage: ObservationCoverage): string | null {

[Survived] ConditionalExpression
src/lib/garden-beds.ts:393:7
 }
 
 function getSeverityReason(severity: number): string | null {
-  if (severity >= 5) return "bardzo wysokie nasilenie";
+  if (false) return "bardzo wysokie nasilenie";
   if (severity >= 4) return "wysokie nasilenie";
   return null;

[Survived] EqualityOperator
src/lib/garden-beds.ts:393:7
 }
 
 function getSeverityReason(severity: number): string | null {
-  if (severity >= 5) return "bardzo wysokie nasilenie";
+  if (severity > 5) return "bardzo wysokie nasilenie";
   if (severity >= 4) return "wysokie nasilenie";
   return null;

[Survived] EqualityOperator
src/lib/garden-beds.ts:394:7
 
 function getSeverityReason(severity: number): string | null {
   if (severity >= 5) return "bardzo wysokie nasilenie";
-  if (severity >= 4) return "wysokie nasilenie";
+  if (severity < 4) return "wysokie nasilenie";
   return null;
 }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:394:7
 
 function getSeverityReason(severity: number): string | null {
   if (severity >= 5) return "bardzo wysokie nasilenie";
-  if (severity >= 4) return "wysokie nasilenie";
+  if (false) return "wysokie nasilenie";
   return null;
 }

[Killed] BlockStatement
src/lib/garden-beds.ts:398:74
   return null;
 }
 
-function getCoverageReason(coverage: ObservationCoverage): string | null {
-  if (coverage === "high") return "wysokie pokrycie";
-  if (coverage === "medium") return "średnie pokrycie";
-  return null;
-}
+function getCoverageReason(coverage: ObservationCoverage): string | null {}
 
 function getGrowthStageReason(growthStage: GrowthStage): string | null {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:399:7
 }
 
 function getCoverageReason(coverage: ObservationCoverage): string | null {
-  if (coverage === "high") return "wysokie pokrycie";
+  if (coverage !== "high") return "wysokie pokrycie";
   if (coverage === "medium") return "średnie pokrycie";
   return null;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:399:7
 }
 
 function getCoverageReason(coverage: ObservationCoverage): string | null {
-  if (coverage === "high") return "wysokie pokrycie";
+  if (false) return "wysokie pokrycie";
   if (coverage === "medium") return "średnie pokrycie";
   return null;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] EqualityOperator
src/lib/garden-beds.ts:400:7
 
 function getCoverageReason(coverage: ObservationCoverage): string | null {
   if (coverage === "high") return "wysokie pokrycie";
-  if (coverage === "medium") return "średnie pokrycie";
+  if (coverage !== "medium") return "średnie pokrycie";
   return null;
 }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:400:7
 
 function getCoverageReason(coverage: ObservationCoverage): string | null {
   if (coverage === "high") return "wysokie pokrycie";
-  if (coverage === "medium") return "średnie pokrycie";
+  if (true) return "średnie pokrycie";
   return null;
 }

[Killed] BlockStatement
src/lib/garden-beds.ts:404:72
   return null;
 }
 
-function getGrowthStageReason(growthStage: GrowthStage): string | null {
-  if (growthStage === "seeding") return "rozsiewanie nasion";
-  if (growthStage === "flowering") return "kwitnienie";
-  if (growthStage === "vegetative") return "aktywny wzrost";
-  return null;
-}
+function getGrowthStageReason(growthStage: GrowthStage): string | null {}
 
 function getTopObservationReasons(reasonScores: Map<string, number>, observationCount: number): string[] {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:405:7
 }
 
 function getGrowthStageReason(growthStage: GrowthStage): string | null {
-  if (growthStage === "seeding") return "rozsiewanie nasion";
+  if (growthStage !== "seeding") return "rozsiewanie nasion";
   if (growthStage === "flowering") return "kwitnienie";
   if (growthStage === "vegetative") return "aktywny wzrost";
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:405:7
 }
 
 function getGrowthStageReason(growthStage: GrowthStage): string | null {
-  if (growthStage === "seeding") return "rozsiewanie nasion";
+  if (false) return "rozsiewanie nasion";
   if (growthStage === "flowering") return "kwitnienie";
   if (growthStage === "vegetative") return "aktywny wzrost";
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] EqualityOperator
src/lib/garden-beds.ts:406:7
 
 function getGrowthStageReason(growthStage: GrowthStage): string | null {
   if (growthStage === "seeding") return "rozsiewanie nasion";
-  if (growthStage === "flowering") return "kwitnienie";
+  if (growthStage !== "flowering") return "kwitnienie";
   if (growthStage === "vegetative") return "aktywny wzrost";
   return null;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:406:7
 
 function getGrowthStageReason(growthStage: GrowthStage): string | null {
   if (growthStage === "seeding") return "rozsiewanie nasion";
-  if (growthStage === "flowering") return "kwitnienie";
+  if (true) return "kwitnienie";
   if (growthStage === "vegetative") return "aktywny wzrost";
   return null;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:407:7
 function getGrowthStageReason(growthStage: GrowthStage): string | null {
   if (growthStage === "seeding") return "rozsiewanie nasion";
   if (growthStage === "flowering") return "kwitnienie";
-  if (growthStage === "vegetative") return "aktywny wzrost";
+  if (true) return "aktywny wzrost";
   return null;
 }

[Survived] EqualityOperator
src/lib/garden-beds.ts:407:7
 function getGrowthStageReason(growthStage: GrowthStage): string | null {
   if (growthStage === "seeding") return "rozsiewanie nasion";
   if (growthStage === "flowering") return "kwitnienie";
-  if (growthStage === "vegetative") return "aktywny wzrost";
+  if (growthStage !== "vegetative") return "aktywny wzrost";
   return null;
 }

[Killed] BlockStatement
src/lib/garden-beds.ts:411:106
   return null;
 }
 
-function getTopObservationReasons(reasonScores: Map<string, number>, observationCount: number): string[] {
-  const reasons = [...reasonScores.entries()]
-    .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0], "pl"))
-    .slice(0, 4)
-    .map(([reason]) => reason);
-
-  if (observationCount > 1) {
-    reasons.push("powtarzające się obserwacje");
-  }
-
-  return [...new Set(reasons)].slice(0, 4);
-}
+function getTopObservationReasons(reasonScores: Map<string, number>, observationCount: number): string[] {}
 
 function getObservationPressureLabel(score: number): string {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] MethodExpression
src/lib/garden-beds.ts:412:19
 }
 
 function getTopObservationReasons(reasonScores: Map<string, number>, observationCount: number): string[] {
-  const reasons = [...reasonScores.entries()]
-    .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0], "pl"))
-    .slice(0, 4)
+  const reasons = [...reasonScores.entries()].sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0], "pl"))
     .map(([reason]) => reason);
 

[Survived] MethodExpression
src/lib/garden-beds.ts:412:19
 }
 
 function getTopObservationReasons(reasonScores: Map<string, number>, observationCount: number): string[] {
-  const reasons = [...reasonScores.entries()]
-    .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0], "pl"))
+  const reasons = [...reasonScores.entries()]
     .slice(0, 4)
     .map(([reason]) => reason);

[Killed] LogicalOperator
src/lib/garden-beds.ts:413:21
 
 function getTopObservationReasons(reasonScores: Map<string, number>, observationCount: number): string[] {
   const reasons = [...reasonScores.entries()]
-    .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0], "pl"))
+    .sort((a, b) => b[1] - a[1] && a[0].localeCompare(b[0], "pl"))
     .slice(0, 4)
     .map(([reason]) => reason);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:413:21
 
 function getTopObservationReasons(reasonScores: Map<string, number>, observationCount: number): string[] {
   const reasons = [...reasonScores.entries()]
-    .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0], "pl"))
+    .sort((a, b) => b[1] + a[1] || a[0].localeCompare(b[0], "pl"))
     .slice(0, 4)
     .map(([reason]) => reason);

[Killed] ArrowFunction
src/lib/garden-beds.ts:415:10
   const reasons = [...reasonScores.entries()]
     .sort((a, b) => b[1] - a[1] || a[0].localeCompare(b[0], "pl"))
     .slice(0, 4)
-    .map(([reason]) => reason);
+    .map(() => undefined);
 
   if (observationCount > 1) {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:417:7
     .slice(0, 4)
     .map(([reason]) => reason);
 
-  if (observationCount > 1) {
+  if (observationCount <= 1) {
     reasons.push("powtarzające się obserwacje");
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL
