[Killed] BlockStatement
src/lib/garden-beds.ts:417:29
     .slice(0, 4)
     .map(([reason]) => reason);
 
-  if (observationCount > 1) {
-    reasons.push("powtarzające się obserwacje");
-  }
+  if (observationCount > 1) {}
 
   return [...new Set(reasons)].slice(0, 4);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] StringLiteral
src/lib/garden-beds.ts:418:18
     .map(([reason]) => reason);
 
   if (observationCount > 1) {
-    reasons.push("powtarzające się obserwacje");
+    reasons.push("");
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] MethodExpression
src/lib/garden-beds.ts:421:10
     reasons.push("powtarzające się obserwacje");
   }
 
-  return [...new Set(reasons)].slice(0, 4);
+  return [...new Set(reasons)];
 }
 

[Killed] BlockStatement
src/lib/garden-beds.ts:424:61
   return [...new Set(reasons)].slice(0, 4);
 }
 
-function getObservationPressureLabel(score: number): string {
-  if (score >= 70) return "bardzo wysoka presja z obserwacji";
-  if (score >= 50) return "wysoka presja z obserwacji";
-  if (score >= 30) return "średnia presja z obserwacji";
-  if (score >= 15) return "niska presja z obserwacji";
-  return "brak istotnej presji z obserwacji";
-}
+function getObservationPressureLabel(score: number): string {}
 
 function adjustSuggestedIntervalDays(baseDays: number, pressure: number): number {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:425:7
 }
 
 function getObservationPressureLabel(score: number): string {
-  if (score >= 70) return "bardzo wysoka presja z obserwacji";
+  if (score < 70) return "bardzo wysoka presja z obserwacji";
   if (score >= 50) return "wysoka presja z obserwacji";
   if (score >= 30) return "średnia presja z obserwacji";
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:425:7
 }
 
 function getObservationPressureLabel(score: number): string {
-  if (score >= 70) return "bardzo wysoka presja z obserwacji";
+  if (false) return "bardzo wysoka presja z obserwacji";
   if (score >= 50) return "wysoka presja z obserwacji";
   if (score >= 30) return "średnia presja z obserwacji";
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] EqualityOperator
src/lib/garden-beds.ts:426:7
 
 function getObservationPressureLabel(score: number): string {
   if (score >= 70) return "bardzo wysoka presja z obserwacji";
-  if (score >= 50) return "wysoka presja z obserwacji";
+  if (score < 50) return "wysoka presja z obserwacji";
   if (score >= 30) return "średnia presja z obserwacji";
   if (score >= 15) return "niska presja z obserwacji";

[Survived] ConditionalExpression
src/lib/garden-beds.ts:426:7
 
 function getObservationPressureLabel(score: number): string {
   if (score >= 70) return "bardzo wysoka presja z obserwacji";
-  if (score >= 50) return "wysoka presja z obserwacji";
+  if (false) return "wysoka presja z obserwacji";
   if (score >= 30) return "średnia presja z obserwacji";
   if (score >= 15) return "niska presja z obserwacji";

[Survived] ConditionalExpression
src/lib/garden-beds.ts:427:7
 function getObservationPressureLabel(score: number): string {
   if (score >= 70) return "bardzo wysoka presja z obserwacji";
   if (score >= 50) return "wysoka presja z obserwacji";
-  if (score >= 30) return "średnia presja z obserwacji";
+  if (false) return "średnia presja z obserwacji";
   if (score >= 15) return "niska presja z obserwacji";
   return "brak istotnej presji z obserwacji";

[Survived] EqualityOperator
src/lib/garden-beds.ts:427:7
 function getObservationPressureLabel(score: number): string {
   if (score >= 70) return "bardzo wysoka presja z obserwacji";
   if (score >= 50) return "wysoka presja z obserwacji";
-  if (score >= 30) return "średnia presja z obserwacji";
+  if (score > 30) return "średnia presja z obserwacji";
   if (score >= 15) return "niska presja z obserwacji";
   return "brak istotnej presji z obserwacji";

[Survived] ConditionalExpression
src/lib/garden-beds.ts:428:7
   if (score >= 70) return "bardzo wysoka presja z obserwacji";
   if (score >= 50) return "wysoka presja z obserwacji";
   if (score >= 30) return "średnia presja z obserwacji";
-  if (score >= 15) return "niska presja z obserwacji";
+  if (false) return "niska presja z obserwacji";
   return "brak istotnej presji z obserwacji";
 }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:428:7
   if (score >= 70) return "bardzo wysoka presja z obserwacji";
   if (score >= 50) return "wysoka presja z obserwacji";
   if (score >= 30) return "średnia presja z obserwacji";
-  if (score >= 15) return "niska presja z obserwacji";
+  if (true) return "niska presja z obserwacji";
   return "brak istotnej presji z obserwacji";
 }

[Killed] BlockStatement
src/lib/garden-beds.ts:432:82
   return "brak istotnej presji z obserwacji";
 }
 
-function adjustSuggestedIntervalDays(baseDays: number, pressure: number): number {
-  if (pressure >= 70) return Math.max(1, Math.round(baseDays * 0.35));
-  if (pressure >= 50) return Math.max(2, Math.round(baseDays * 0.5));
-  if (pressure >= 30) return Math.max(3, Math.round(baseDays * 0.65));
-  if (pressure >= 15) return Math.max(5, Math.round(baseDays * 0.8));
-  return baseDays;
-}
+function adjustSuggestedIntervalDays(baseDays: number, pressure: number): number {}
 
 function getObservationResponseWindowDays(pressure: number): number | null {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:433:7
 }
 
 function adjustSuggestedIntervalDays(baseDays: number, pressure: number): number {
-  if (pressure >= 70) return Math.max(1, Math.round(baseDays * 0.35));
+  if (false) return Math.max(1, Math.round(baseDays * 0.35));
   if (pressure >= 50) return Math.max(2, Math.round(baseDays * 0.5));
   if (pressure >= 30) return Math.max(3, Math.round(baseDays * 0.65));
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:433:7
 }
 
 function adjustSuggestedIntervalDays(baseDays: number, pressure: number): number {
-  if (pressure >= 70) return Math.max(1, Math.round(baseDays * 0.35));
+  if (pressure < 70) return Math.max(1, Math.round(baseDays * 0.35));
   if (pressure >= 50) return Math.max(2, Math.round(baseDays * 0.5));
   if (pressure >= 30) return Math.max(3, Math.round(baseDays * 0.65));
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:434:7
 
 function adjustSuggestedIntervalDays(baseDays: number, pressure: number): number {
   if (pressure >= 70) return Math.max(1, Math.round(baseDays * 0.35));
-  if (pressure >= 50) return Math.max(2, Math.round(baseDays * 0.5));
+  if (pressure < 50) return Math.max(2, Math.round(baseDays * 0.5));
   if (pressure >= 30) return Math.max(3, Math.round(baseDays * 0.65));
   if (pressure >= 15) return Math.max(5, Math.round(baseDays * 0.8));
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:434:7
 
 function adjustSuggestedIntervalDays(baseDays: number, pressure: number): number {
   if (pressure >= 70) return Math.max(1, Math.round(baseDays * 0.35));
-  if (pressure >= 50) return Math.max(2, Math.round(baseDays * 0.5));
+  if (true) return Math.max(2, Math.round(baseDays * 0.5));
   if (pressure >= 30) return Math.max(3, Math.round(baseDays * 0.65));
   if (pressure >= 15) return Math.max(5, Math.round(baseDays * 0.8));
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:435:7
 function adjustSuggestedIntervalDays(baseDays: number, pressure: number): number {
   if (pressure >= 70) return Math.max(1, Math.round(baseDays * 0.35));
   if (pressure >= 50) return Math.max(2, Math.round(baseDays * 0.5));
-  if (pressure >= 30) return Math.max(3, Math.round(baseDays * 0.65));
+  if (true) return Math.max(3, Math.round(baseDays * 0.65));
   if (pressure >= 15) return Math.max(5, Math.round(baseDays * 0.8));
   return baseDays;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:435:7
 function adjustSuggestedIntervalDays(baseDays: number, pressure: number): number {
   if (pressure >= 70) return Math.max(1, Math.round(baseDays * 0.35));
   if (pressure >= 50) return Math.max(2, Math.round(baseDays * 0.5));
-  if (pressure >= 30) return Math.max(3, Math.round(baseDays * 0.65));
+  if (pressure < 30) return Math.max(3, Math.round(baseDays * 0.65));
   if (pressure >= 15) return Math.max(5, Math.round(baseDays * 0.8));
   return baseDays;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:436:7
   if (pressure >= 70) return Math.max(1, Math.round(baseDays * 0.35));
   if (pressure >= 50) return Math.max(2, Math.round(baseDays * 0.5));
   if (pressure >= 30) return Math.max(3, Math.round(baseDays * 0.65));
-  if (pressure >= 15) return Math.max(5, Math.round(baseDays * 0.8));
+  if (true) return Math.max(5, Math.round(baseDays * 0.8));
   return baseDays;
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:436:7
   if (pressure >= 70) return Math.max(1, Math.round(baseDays * 0.35));
   if (pressure >= 50) return Math.max(2, Math.round(baseDays * 0.5));
   if (pressure >= 30) return Math.max(3, Math.round(baseDays * 0.65));
-  if (pressure >= 15) return Math.max(5, Math.round(baseDays * 0.8));
+  if (pressure < 15) return Math.max(5, Math.round(baseDays * 0.8));
   return baseDays;
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:440:76
   return baseDays;
 }
 
-function getObservationResponseWindowDays(pressure: number): number | null {
-  if (pressure >= 70) return 1;
-  if (pressure >= 50) return 3;
-  if (pressure >= 30) return 7;
-  if (pressure >= 15) return 14;
-  return null;
-}
+function getObservationResponseWindowDays(pressure: number): number | null {}
 
 function getObservationAgeDays(observedAt: string, today: Date): number | null {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ConditionalExpression
src/lib/garden-beds.ts:441:7
 }
 
 function getObservationResponseWindowDays(pressure: number): number | null {
-  if (pressure >= 70) return 1;
+  if (true) return 1;
   if (pressure >= 50) return 3;
   if (pressure >= 30) return 7;

[Survived] EqualityOperator
src/lib/garden-beds.ts:441:7
 }
 
 function getObservationResponseWindowDays(pressure: number): number | null {
-  if (pressure >= 70) return 1;
+  if (pressure > 70) return 1;
   if (pressure >= 50) return 3;
   if (pressure >= 30) return 7;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:442:7
 
 function getObservationResponseWindowDays(pressure: number): number | null {
   if (pressure >= 70) return 1;
-  if (pressure >= 50) return 3;
+  if (false) return 3;
   if (pressure >= 30) return 7;
   if (pressure >= 15) return 14;

[Survived] EqualityOperator
src/lib/garden-beds.ts:442:7
 
 function getObservationResponseWindowDays(pressure: number): number | null {
   if (pressure >= 70) return 1;
-  if (pressure >= 50) return 3;
+  if (pressure > 50) return 3;
   if (pressure >= 30) return 7;
   if (pressure >= 15) return 14;

[Survived] EqualityOperator
src/lib/garden-beds.ts:443:7
 function getObservationResponseWindowDays(pressure: number): number | null {
   if (pressure >= 70) return 1;
   if (pressure >= 50) return 3;
-  if (pressure >= 30) return 7;
+  if (pressure < 30) return 7;
   if (pressure >= 15) return 14;
   return null;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:443:7
 function getObservationResponseWindowDays(pressure: number): number | null {
   if (pressure >= 70) return 1;
   if (pressure >= 50) return 3;
-  if (pressure >= 30) return 7;
+  if (true) return 7;
   if (pressure >= 15) return 14;
   return null;

[Survived] EqualityOperator
src/lib/garden-beds.ts:444:7
   if (pressure >= 70) return 1;
   if (pressure >= 50) return 3;
   if (pressure >= 30) return 7;
-  if (pressure >= 15) return 14;
+  if (pressure > 15) return 14;
   return null;
 }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:444:7
   if (pressure >= 70) return 1;
   if (pressure >= 50) return 3;
   if (pressure >= 30) return 7;
-  if (pressure >= 15) return 14;
+  if (false) return 14;
   return null;
 }

[Killed] BlockStatement
src/lib/garden-beds.ts:448:80
   return null;
 }
 
-function getObservationAgeDays(observedAt: string, today: Date): number | null {
-  const observedDate = parseIsoDate(observedAt);
-  if (!observedDate) return null;
-  return Math.floor((today.getTime() - observedDate.getTime()) / DAY_MS);
-}
+function getObservationAgeDays(observedAt: string, today: Date): number | null {}
 
 function addDays(date: Date, days: number): string {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:450:7
 
 function getObservationAgeDays(observedAt: string, today: Date): number | null {
   const observedDate = parseIsoDate(observedAt);
-  if (!observedDate) return null;
+  if (true) return null;
   return Math.floor((today.getTime() - observedDate.getTime()) / DAY_MS);
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/garden-beds.ts:450:7
 
 function getObservationAgeDays(observedAt: string, today: Date): number | null {
   const observedDate = parseIsoDate(observedAt);
-  if (!observedDate) return null;
+  if (observedDate) return null;
   return Math.floor((today.getTime() - observedDate.getTime()) / DAY_MS);
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArithmeticOperator
src/lib/garden-beds.ts:451:21
 function getObservationAgeDays(observedAt: string, today: Date): number | null {
   const observedDate = parseIsoDate(observedAt);
   if (!observedDate) return null;
-  return Math.floor((today.getTime() - observedDate.getTime()) / DAY_MS);
+  return Math.floor((today.getTime() - observedDate.getTime()) * DAY_MS);
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArithmeticOperator
src/lib/garden-beds.ts:451:22
 function getObservationAgeDays(observedAt: string, today: Date): number | null {
   const observedDate = parseIsoDate(observedAt);
   if (!observedDate) return null;
-  return Math.floor((today.getTime() - observedDate.getTime()) / DAY_MS);
+  return Math.floor((today.getTime() + observedDate.getTime()) / DAY_MS);
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:454:52
   return Math.floor((today.getTime() - observedDate.getTime()) / DAY_MS);
 }
 
-function addDays(date: Date, days: number): string {
-  const nextDate = new Date(date.getTime());
-  nextDate.setUTCDate(nextDate.getUTCDate() + days);
-  return formatIsoDate(nextDate);
-}
+function addDays(date: Date, days: number): string {}
 
 function getPriorityFromScore(score: number): BedQueuePriority {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArithmeticOperator
src/lib/garden-beds.ts:456:23
 
 function addDays(date: Date, days: number): string {
   const nextDate = new Date(date.getTime());
-  nextDate.setUTCDate(nextDate.getUTCDate() + days);
+  nextDate.setUTCDate(nextDate.getUTCDate() - days);
   return formatIsoDate(nextDate);
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] MethodExpression
src/lib/garden-beds.ts:456:3
 
 function addDays(date: Date, days: number): string {
   const nextDate = new Date(date.getTime());
-  nextDate.setUTCDate(nextDate.getUTCDate() + days);
+  nextDate.setTime(nextDate.getUTCDate() + days);
   return formatIsoDate(nextDate);
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:460:64
   return formatIsoDate(nextDate);
 }
 
-function getPriorityFromScore(score: number): BedQueuePriority {
-  if (score >= PRIORITY_SCORE_THRESHOLDS.urgent) return "urgent";
-  if (score >= PRIORITY_SCORE_THRESHOLDS.soon) return "soon";
-  return "ok";
-}
+function getPriorityFromScore(score: number): BedQueuePriority {}
 
 function getElapsedDaysScore(lastWeededAt: string | null, weedLevel: WeedLevel): number {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:461:7
 }
 
 function getPriorityFromScore(score: number): BedQueuePriority {
-  if (score >= PRIORITY_SCORE_THRESHOLDS.urgent) return "urgent";
+  if (score < PRIORITY_SCORE_THRESHOLDS.urgent) return "urgent";
   if (score >= PRIORITY_SCORE_THRESHOLDS.soon) return "soon";
   return "ok";
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:461:7
 }
 
 function getPriorityFromScore(score: number): BedQueuePriority {
-  if (score >= PRIORITY_SCORE_THRESHOLDS.urgent) return "urgent";
+  if (false) return "urgent";
   if (score >= PRIORITY_SCORE_THRESHOLDS.soon) return "soon";
   return "ok";
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:462:7
 
 function getPriorityFromScore(score: number): BedQueuePriority {
   if (score >= PRIORITY_SCORE_THRESHOLDS.urgent) return "urgent";
-  if (score >= PRIORITY_SCORE_THRESHOLDS.soon) return "soon";
+  if (score < PRIORITY_SCORE_THRESHOLDS.soon) return "soon";
   return "ok";
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:462:7
 
 function getPriorityFromScore(score: number): BedQueuePriority {
   if (score >= PRIORITY_SCORE_THRESHOLDS.urgent) return "urgent";
-  if (score >= PRIORITY_SCORE_THRESHOLDS.soon) return "soon";
+  if (true) return "soon";
   return "ok";
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:466:89
   return "ok";
 }
 
-function getElapsedDaysScore(lastWeededAt: string | null, weedLevel: WeedLevel): number {
-  if (!lastWeededAt) return 0;
-
-  const lastWeededDate = parseIsoDate(lastWeededAt);
-  if (!lastWeededDate) return 0;
-
-  const daysSinceLastWeeding = Math.max(
-    0,
-    Math.floor((startOfUtcToday().getTime() - lastWeededDate.getTime()) / DAY_MS),
-  );
-  const expectedInterval = SUGGESTED_WEED_INTERVAL_DAYS[weedLevel];
-
-  if (daysSinceLastWeeding >= expectedInterval * 2) return 35;
-  if (daysSinceLastWeeding >= expectedInterval) return 25;
-  if (daysSinceLastWeeding >= expectedInterval * 0.75) return 15;
-
-  return 0;
-}
+function getElapsedDaysScore(lastWeededAt: string | null, weedLevel: WeedLevel): number {}
 
 function getAreaScore(areaM2: number | null): number {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/garden-beds.ts:467:7
 }
 
 function getElapsedDaysScore(lastWeededAt: string | null, weedLevel: WeedLevel): number {
-  if (!lastWeededAt) return 0;
+  if (lastWeededAt) return 0;
 
   const lastWeededDate = parseIsoDate(lastWeededAt);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:467:7
 }
 
 function getElapsedDaysScore(lastWeededAt: string | null, weedLevel: WeedLevel): number {
-  if (!lastWeededAt) return 0;
+  if (true) return 0;
 
   const lastWeededDate = parseIsoDate(lastWeededAt);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:470:7
   if (!lastWeededAt) return 0;
 
   const lastWeededDate = parseIsoDate(lastWeededAt);
-  if (!lastWeededDate) return 0;
+  if (true) return 0;
 
   const daysSinceLastWeeding = Math.max(
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/garden-beds.ts:470:7
   if (!lastWeededAt) return 0;
 
   const lastWeededDate = parseIsoDate(lastWeededAt);
-  if (!lastWeededDate) return 0;
+  if (lastWeededDate) return 0;
 
   const daysSinceLastWeeding = Math.max(
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] MethodExpression
src/lib/garden-beds.ts:472:32
   const lastWeededDate = parseIsoDate(lastWeededAt);
   if (!lastWeededDate) return 0;
 
-  const daysSinceLastWeeding = Math.max(
-    0,
-    Math.floor((startOfUtcToday().getTime() - lastWeededDate.getTime()) / DAY_MS),
-  );
+  const daysSinceLastWeeding = Math.min(0, Math.floor((startOfUtcToday().getTime() - lastWeededDate.getTime()) / DAY_MS));
   const expectedInterval = SUGGESTED_WEED_INTERVAL_DAYS[weedLevel];
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:474:16
 
   const daysSinceLastWeeding = Math.max(
     0,
-    Math.floor((startOfUtcToday().getTime() - lastWeededDate.getTime()) / DAY_MS),
+    Math.floor((startOfUtcToday().getTime() - lastWeededDate.getTime()) * DAY_MS),
   );
   const expectedInterval = SUGGESTED_WEED_INTERVAL_DAYS[weedLevel];

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:474:17
 
   const daysSinceLastWeeding = Math.max(
     0,
-    Math.floor((startOfUtcToday().getTime() - lastWeededDate.getTime()) / DAY_MS),
+    Math.floor((startOfUtcToday().getTime() + lastWeededDate.getTime()) / DAY_MS),
   );
   const expectedInterval = SUGGESTED_WEED_INTERVAL_DAYS[weedLevel];

[Survived] EqualityOperator
src/lib/garden-beds.ts:478:7
   );
   const expectedInterval = SUGGESTED_WEED_INTERVAL_DAYS[weedLevel];
 
-  if (daysSinceLastWeeding >= expectedInterval * 2) return 35;
+  if (daysSinceLastWeeding > expectedInterval * 2) return 35;
   if (daysSinceLastWeeding >= expectedInterval) return 25;
   if (daysSinceLastWeeding >= expectedInterval * 0.75) return 15;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:478:7
   );
   const expectedInterval = SUGGESTED_WEED_INTERVAL_DAYS[weedLevel];
 
-  if (daysSinceLastWeeding >= expectedInterval * 2) return 35;
+  if (false) return 35;
   if (daysSinceLastWeeding >= expectedInterval) return 25;
   if (daysSinceLastWeeding >= expectedInterval * 0.75) return 15;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:479:7
   const expectedInterval = SUGGESTED_WEED_INTERVAL_DAYS[weedLevel];
 
   if (daysSinceLastWeeding >= expectedInterval * 2) return 35;
-  if (daysSinceLastWeeding >= expectedInterval) return 25;
+  if (true) return 25;
   if (daysSinceLastWeeding >= expectedInterval * 0.75) return 15;
 

[Survived] EqualityOperator
src/lib/garden-beds.ts:479:7
   const expectedInterval = SUGGESTED_WEED_INTERVAL_DAYS[weedLevel];
 
   if (daysSinceLastWeeding >= expectedInterval * 2) return 35;
-  if (daysSinceLastWeeding >= expectedInterval) return 25;
+  if (daysSinceLastWeeding > expectedInterval) return 25;
   if (daysSinceLastWeeding >= expectedInterval * 0.75) return 15;
 

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:480:31
 
   if (daysSinceLastWeeding >= expectedInterval * 2) return 35;
   if (daysSinceLastWeeding >= expectedInterval) return 25;
-  if (daysSinceLastWeeding >= expectedInterval * 0.75) return 15;
+  if (daysSinceLastWeeding >= expectedInterval / 0.75) return 15;
 
   return 0;

[Survived] EqualityOperator
src/lib/garden-beds.ts:480:7
 
   if (daysSinceLastWeeding >= expectedInterval * 2) return 35;
   if (daysSinceLastWeeding >= expectedInterval) return 25;
-  if (daysSinceLastWeeding >= expectedInterval * 0.75) return 15;
+  if (daysSinceLastWeeding < expectedInterval * 0.75) return 15;
 
   return 0;

[Killed] BlockStatement
src/lib/garden-beds.ts:485:54
   return 0;
 }
 
-function getAreaScore(areaM2: number | null): number {
-  if (areaM2 === null) return 0;
-  if (areaM2 >= 20) return 10;
-  if (areaM2 >= 10) return 5;
-  return 0;
-}
+function getAreaScore(areaM2: number | null): number {}
 
 function getEstimatedMinutesScore(estimatedMinutes: number | null): number {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] EqualityOperator
src/lib/garden-beds.ts:486:7
 }
 
 function getAreaScore(areaM2: number | null): number {
-  if (areaM2 === null) return 0;
+  if (areaM2 !== null) return 0;
   if (areaM2 >= 20) return 10;
   if (areaM2 >= 10) return 5;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:486:7
 }
 
 function getAreaScore(areaM2: number | null): number {
-  if (areaM2 === null) return 0;
+  if (true) return 0;
   if (areaM2 >= 20) return 10;
   if (areaM2 >= 10) return 5;

[Survived] EqualityOperator
src/lib/garden-beds.ts:487:7
 
 function getAreaScore(areaM2: number | null): number {
   if (areaM2 === null) return 0;
-  if (areaM2 >= 20) return 10;
+  if (areaM2 < 20) return 10;
   if (areaM2 >= 10) return 5;
   return 0;

[Survived] EqualityOperator
src/lib/garden-beds.ts:487:7
 
 function getAreaScore(areaM2: number | null): number {
   if (areaM2 === null) return 0;
-  if (areaM2 >= 20) return 10;
+  if (areaM2 > 20) return 10;
   if (areaM2 >= 10) return 5;
   return 0;

[Survived] EqualityOperator
src/lib/garden-beds.ts:488:7
 function getAreaScore(areaM2: number | null): number {
   if (areaM2 === null) return 0;
   if (areaM2 >= 20) return 10;
-  if (areaM2 >= 10) return 5;
+  if (areaM2 > 10) return 5;
   return 0;
 }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:488:7
 function getAreaScore(areaM2: number | null): number {
   if (areaM2 === null) return 0;
   if (areaM2 >= 20) return 10;
-  if (areaM2 >= 10) return 5;
+  if (false) return 5;
   return 0;
 }

[Killed] BlockStatement
src/lib/garden-beds.ts:492:76
   return 0;
 }
 
-function getEstimatedMinutesScore(estimatedMinutes: number | null): number {
-  if (estimatedMinutes === null) return 0;
-  if (estimatedMinutes >= 90) return 10;
-  if (estimatedMinutes >= 45) return 5;
-  return 0;
-}
+function getEstimatedMinutesScore(estimatedMinutes: number | null): number {}
 
 function getMulchDepthScore(mulchDepthCm: number | null): number {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL
