[Survived] EqualityOperator
src/lib/garden-beds.ts:493:7
 }
 
 function getEstimatedMinutesScore(estimatedMinutes: number | null): number {
-  if (estimatedMinutes === null) return 0;
+  if (estimatedMinutes !== null) return 0;
   if (estimatedMinutes >= 90) return 10;
   if (estimatedMinutes >= 45) return 5;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:493:7
 }
 
 function getEstimatedMinutesScore(estimatedMinutes: number | null): number {
-  if (estimatedMinutes === null) return 0;
+  if (true) return 0;
   if (estimatedMinutes >= 90) return 10;
   if (estimatedMinutes >= 45) return 5;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:494:7
 
 function getEstimatedMinutesScore(estimatedMinutes: number | null): number {
   if (estimatedMinutes === null) return 0;
-  if (estimatedMinutes >= 90) return 10;
+  if (true) return 10;
   if (estimatedMinutes >= 45) return 5;
   return 0;

[Survived] EqualityOperator
src/lib/garden-beds.ts:494:7
 
 function getEstimatedMinutesScore(estimatedMinutes: number | null): number {
   if (estimatedMinutes === null) return 0;
-  if (estimatedMinutes >= 90) return 10;
+  if (estimatedMinutes > 90) return 10;
   if (estimatedMinutes >= 45) return 5;
   return 0;

[Survived] EqualityOperator
src/lib/garden-beds.ts:495:7
 function getEstimatedMinutesScore(estimatedMinutes: number | null): number {
   if (estimatedMinutes === null) return 0;
   if (estimatedMinutes >= 90) return 10;
-  if (estimatedMinutes >= 45) return 5;
+  if (estimatedMinutes < 45) return 5;
   return 0;
 }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:495:7
 function getEstimatedMinutesScore(estimatedMinutes: number | null): number {
   if (estimatedMinutes === null) return 0;
   if (estimatedMinutes >= 90) return 10;
-  if (estimatedMinutes >= 45) return 5;
+  if (true) return 5;
   return 0;
 }

[Killed] BlockStatement
src/lib/garden-beds.ts:499:66
   return 0;
 }
 
-function getMulchDepthScore(mulchDepthCm: number | null): number {
-  if (mulchDepthCm === null) return 0;
-  if (mulchDepthCm === 0) return 15;
-  if (mulchDepthCm < 3) return 10;
-  if (mulchDepthCm < 5) return 5;
-  return 0;
-}
+function getMulchDepthScore(mulchDepthCm: number | null): number {}
 
 function hasCompletePriorityInputs(bed: GardenBedResponse | GardenBedRow): boolean {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ConditionalExpression
src/lib/garden-beds.ts:500:7
 }
 
 function getMulchDepthScore(mulchDepthCm: number | null): number {
-  if (mulchDepthCm === null) return 0;
+  if (false) return 0;
   if (mulchDepthCm === 0) return 15;
   if (mulchDepthCm < 3) return 10;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:500:7
 }
 
 function getMulchDepthScore(mulchDepthCm: number | null): number {
-  if (mulchDepthCm === null) return 0;
+  if (true) return 0;
   if (mulchDepthCm === 0) return 15;
   if (mulchDepthCm < 3) return 10;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:501:7
 
 function getMulchDepthScore(mulchDepthCm: number | null): number {
   if (mulchDepthCm === null) return 0;
-  if (mulchDepthCm === 0) return 15;
+  if (false) return 15;
   if (mulchDepthCm < 3) return 10;
   if (mulchDepthCm < 5) return 5;

[Survived] EqualityOperator
src/lib/garden-beds.ts:501:7
 
 function getMulchDepthScore(mulchDepthCm: number | null): number {
   if (mulchDepthCm === null) return 0;
-  if (mulchDepthCm === 0) return 15;
+  if (mulchDepthCm !== 0) return 15;
   if (mulchDepthCm < 3) return 10;
   if (mulchDepthCm < 5) return 5;

[Survived] EqualityOperator
src/lib/garden-beds.ts:502:7
 function getMulchDepthScore(mulchDepthCm: number | null): number {
   if (mulchDepthCm === null) return 0;
   if (mulchDepthCm === 0) return 15;
-  if (mulchDepthCm < 3) return 10;
+  if (mulchDepthCm <= 3) return 10;
   if (mulchDepthCm < 5) return 5;
   return 0;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:502:7
 function getMulchDepthScore(mulchDepthCm: number | null): number {
   if (mulchDepthCm === null) return 0;
   if (mulchDepthCm === 0) return 15;
-  if (mulchDepthCm < 3) return 10;
+  if (true) return 10;
   if (mulchDepthCm < 5) return 5;
   return 0;

[Survived] EqualityOperator
src/lib/garden-beds.ts:503:7
   if (mulchDepthCm === null) return 0;
   if (mulchDepthCm === 0) return 15;
   if (mulchDepthCm < 3) return 10;
-  if (mulchDepthCm < 5) return 5;
+  if (mulchDepthCm <= 5) return 5;
   return 0;
 }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:503:7
   if (mulchDepthCm === null) return 0;
   if (mulchDepthCm === 0) return 15;
   if (mulchDepthCm < 3) return 10;
-  if (mulchDepthCm < 5) return 5;
+  if (true) return 5;
   return 0;
 }

[Survived] BlockStatement
src/lib/garden-beds.ts:507:84
   return 0;
 }
 
-function hasCompletePriorityInputs(bed: GardenBedResponse | GardenBedRow): boolean {
-  return (
-    bed.area_m2 !== null && bed.last_weeded_at !== null && bed.estimated_minutes !== null && bed.mulch_depth_cm !== null
-  );
-}
+function hasCompletePriorityInputs(bed: GardenBedResponse | GardenBedRow): boolean {}
 
 function compareGardenBedQueueItems(a: GardenBedQueueItem, b: GardenBedQueueItem): number {

[Killed] ConditionalExpression
src/lib/garden-beds.ts:509:5
 
 function hasCompletePriorityInputs(bed: GardenBedResponse | GardenBedRow): boolean {
   return (
-    bed.area_m2 !== null && bed.last_weeded_at !== null && bed.estimated_minutes !== null && bed.mulch_depth_cm !== null
+    true
   );
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ConditionalExpression
src/lib/garden-beds.ts:509:29
 
 function hasCompletePriorityInputs(bed: GardenBedResponse | GardenBedRow): boolean {
   return (
-    bed.area_m2 !== null && bed.last_weeded_at !== null && bed.estimated_minutes !== null && bed.mulch_depth_cm !== null
+    bed.area_m2 !== null && true && bed.estimated_minutes !== null && bed.mulch_depth_cm !== null
   );
 }

[Killed] BlockStatement
src/lib/garden-beds.ts:513:91
   );
 }
 
-function compareGardenBedQueueItems(a: GardenBedQueueItem, b: GardenBedQueueItem): number {
-  return (
-    PRIORITY_SEVERITY[b.priority] - PRIORITY_SEVERITY[a.priority] ||
-    compareNullableIsoDates(a.suggested_weed_at, b.suggested_weed_at) ||
-    WEED_LEVEL_SEVERITY[b.weed_level] - WEED_LEVEL_SEVERITY[a.weed_level] ||
-    compareIsoDateTimes(a.created_at, b.created_at)
-  );
-}
+function compareGardenBedQueueItems(a: GardenBedQueueItem, b: GardenBedQueueItem): number {}
 
 function compareNullableIsoDates(a: string | null, b: string | null): number {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArithmeticOperator
src/lib/garden-beds.ts:515:5
 
 function compareGardenBedQueueItems(a: GardenBedQueueItem, b: GardenBedQueueItem): number {
   return (
-    PRIORITY_SEVERITY[b.priority] - PRIORITY_SEVERITY[a.priority] ||
+    PRIORITY_SEVERITY[b.priority] + PRIORITY_SEVERITY[a.priority] ||
     compareNullableIsoDates(a.suggested_weed_at, b.suggested_weed_at) ||
     WEED_LEVEL_SEVERITY[b.weed_level] - WEED_LEVEL_SEVERITY[a.weed_level] ||
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:515:5
 
 function compareGardenBedQueueItems(a: GardenBedQueueItem, b: GardenBedQueueItem): number {
   return (
-    PRIORITY_SEVERITY[b.priority] - PRIORITY_SEVERITY[a.priority] ||
-    compareNullableIsoDates(a.suggested_weed_at, b.suggested_weed_at) ||
-    WEED_LEVEL_SEVERITY[b.weed_level] - WEED_LEVEL_SEVERITY[a.weed_level] ||
-    compareIsoDateTimes(a.created_at, b.created_at)
+    true
   );
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:517:5
   return (
     PRIORITY_SEVERITY[b.priority] - PRIORITY_SEVERITY[a.priority] ||
     compareNullableIsoDates(a.suggested_weed_at, b.suggested_weed_at) ||
-    WEED_LEVEL_SEVERITY[b.weed_level] - WEED_LEVEL_SEVERITY[a.weed_level] ||
+    WEED_LEVEL_SEVERITY[b.weed_level] + WEED_LEVEL_SEVERITY[a.weed_level] ||
     compareIsoDateTimes(a.created_at, b.created_at)
   );

[Survived] BlockStatement
src/lib/garden-beds.ts:522:78
   );
 }
 
-function compareNullableIsoDates(a: string | null, b: string | null): number {
-  if (a === null && b === null) return 0;
-  if (a === null) return 1;
-  if (b === null) return -1;
-  return a.localeCompare(b);
-}
+function compareNullableIsoDates(a: string | null, b: string | null): number {}
 
 function compareIsoDateTimes(a: string, b: string): number {

[Survived] ConditionalExpression
src/lib/garden-beds.ts:523:7
 }
 
 function compareNullableIsoDates(a: string | null, b: string | null): number {
-  if (a === null && b === null) return 0;
+  if (false) return 0;
   if (a === null) return 1;
   if (b === null) return -1;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:523:7
 }
 
 function compareNullableIsoDates(a: string | null, b: string | null): number {
-  if (a === null && b === null) return 0;
+  if (true) return 0;
   if (a === null) return 1;
   if (b === null) return -1;

[Survived] ConditionalExpression
src/lib/garden-beds.ts:524:7
 
 function compareNullableIsoDates(a: string | null, b: string | null): number {
   if (a === null && b === null) return 0;
-  if (a === null) return 1;
+  if (true) return 1;
   if (b === null) return -1;
   return a.localeCompare(b);

[Survived] EqualityOperator
src/lib/garden-beds.ts:524:7
 
 function compareNullableIsoDates(a: string | null, b: string | null): number {
   if (a === null && b === null) return 0;
-  if (a === null) return 1;
+  if (a !== null) return 1;
   if (b === null) return -1;
   return a.localeCompare(b);

[Killed] EqualityOperator
src/lib/garden-beds.ts:525:7
 function compareNullableIsoDates(a: string | null, b: string | null): number {
   if (a === null && b === null) return 0;
   if (a === null) return 1;
-  if (b === null) return -1;
+  if (b !== null) return -1;
   return a.localeCompare(b);
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:525:7
 function compareNullableIsoDates(a: string | null, b: string | null): number {
   if (a === null && b === null) return 0;
   if (a === null) return 1;
-  if (b === null) return -1;
+  if (true) return -1;
   return a.localeCompare(b);
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BlockStatement
src/lib/garden-beds.ts:529:60
   return a.localeCompare(b);
 }
 
-function compareIsoDateTimes(a: string, b: string): number {
-  const aTime = Date.parse(a);
-  const bTime = Date.parse(b);
-
-  if (Number.isNaN(aTime) || Number.isNaN(bTime)) {
-    return a.localeCompare(b);
-  }
-
-  return bTime - aTime;
-}
+function compareIsoDateTimes(a: string, b: string): number {}
 
 function toGardenBedResponseLike(bed: GardenBedResponse | GardenBedRow): GardenBedResponse {

[Killed] ConditionalExpression
src/lib/garden-beds.ts:533:7
   const aTime = Date.parse(a);
   const bTime = Date.parse(b);
 
-  if (Number.isNaN(aTime) || Number.isNaN(bTime)) {
+  if (true) {
     return a.localeCompare(b);
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BlockStatement
src/lib/garden-beds.ts:533:51
   const aTime = Date.parse(a);
   const bTime = Date.parse(b);
 
-  if (Number.isNaN(aTime) || Number.isNaN(bTime)) {
-    return a.localeCompare(b);
-  }
+  if (Number.isNaN(aTime) || Number.isNaN(bTime)) {}
 
   return bTime - aTime;

[Survived] ArithmeticOperator
src/lib/garden-beds.ts:537:10
     return a.localeCompare(b);
   }
 
-  return bTime - aTime;
+  return bTime + aTime;
 }
 

[Killed] BlockStatement
src/lib/garden-beds.ts:540:92
   return bTime - aTime;
 }
 
-function toGardenBedResponseLike(bed: GardenBedResponse | GardenBedRow): GardenBedResponse {
-  if ("user_id" in bed) return toGardenBedResponse(bed);
-  return bed;
-}
+function toGardenBedResponseLike(bed: GardenBedResponse | GardenBedRow): GardenBedResponse {}
 
 function isRecord(value: unknown): value is Record<string, unknown> {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] ConditionalExpression
src/lib/garden-beds.ts:541:7
 }
 
 function toGardenBedResponseLike(bed: GardenBedResponse | GardenBedRow): GardenBedResponse {
-  if ("user_id" in bed) return toGardenBedResponse(bed);
+  if (false) return toGardenBedResponse(bed);
   return bed;
 }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:541:7
 }
 
 function toGardenBedResponseLike(bed: GardenBedResponse | GardenBedRow): GardenBedResponse {
-  if ("user_id" in bed) return toGardenBedResponse(bed);
+  if (true) return toGardenBedResponse(bed);
   return bed;
 }

[Survived] BooleanLiteral
src/lib/garden-beds.ts:546:57
 }
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return typeof value === "object" && value !== null && Array.isArray(value);
 }
 

[Survived] EqualityOperator
src/lib/garden-beds.ts:546:10
 }
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return typeof value !== "object" && value !== null && !Array.isArray(value);
 }
 

[Survived] BlockStatement
src/lib/garden-beds.ts:549:58
   return typeof value === "object" && value !== null && !Array.isArray(value);
 }
 
-function isWeedLevel(value: unknown): value is WeedLevel {
-  return typeof value === "string" && weedLevelSet.has(value);
-}
+function isWeedLevel(value: unknown): value is WeedLevel {}
 
 type NumberCheck = (value: number) => boolean;

[Survived] EqualityOperator
src/lib/garden-beds.ts:550:10
 }
 
 function isWeedLevel(value: unknown): value is WeedLevel {
-  return typeof value === "string" && weedLevelSet.has(value);
+  return typeof value !== "string" && weedLevelSet.has(value);
 }
 

[Survived] LogicalOperator
src/lib/garden-beds.ts:550:10
 }
 
 function isWeedLevel(value: unknown): value is WeedLevel {
-  return typeof value === "string" && weedLevelSet.has(value);
+  return typeof value === "string" || weedLevelSet.has(value);
 }
 

[Survived] EqualityOperator
src/lib/garden-beds.ts:565:30
 ): OptionalNumberResult {
   const value = source[key];
 
-  if (value === undefined || value === null) {
+  if (value === undefined || value !== null) {
     return { success: true, value: null };
   }

[Survived] ConditionalExpression
src/lib/garden-beds.ts:565:30
 ): OptionalNumberResult {
   const value = source[key];
 
-  if (value === undefined || value === null) {
+  if (value === undefined || false) {
     return { success: true, value: null };
   }

[Survived] LogicalOperator
src/lib/garden-beds.ts:569:7
     return { success: true, value: null };
   }
 
-  if (typeof value !== "number" || !Number.isFinite(value) || !check(value)) {
+  if (typeof value !== "number" && !Number.isFinite(value) || !check(value)) {
     return { success: false, error };
   }

[Survived] BlockStatement
src/lib/garden-beds.ts:569:78
     return { success: true, value: null };
   }
 
-  if (typeof value !== "number" || !Number.isFinite(value) || !check(value)) {
-    return { success: false, error };
-  }
+  if (typeof value !== "number" || !Number.isFinite(value) || !check(value)) {}
 
   return { success: true, value };

[Survived] ObjectLiteral
src/lib/garden-beds.ts:573:10
     return { success: false, error };
   }
 
-  return { success: true, value };
+  return {};
 }
 

[Survived] ConditionalExpression
src/lib/garden-beds.ts:577:10
 }
 
 function isPositiveNumber(value: number): boolean {
-  return value > 0;
+  return true;
 }
 

[Survived] EqualityOperator
src/lib/garden-beds.ts:581:37
 }
 
 function isPositiveInteger(value: number): boolean {
-  return Number.isInteger(value) && value > 0;
+  return Number.isInteger(value) && value >= 0;
 }
 

[Survived] ConditionalExpression
src/lib/garden-beds.ts:581:10
 }
 
 function isPositiveInteger(value: number): boolean {
-  return Number.isInteger(value) && value > 0;
+  return false;
 }
 

[Survived] BlockStatement
src/lib/garden-beds.ts:584:54
   return Number.isInteger(value) && value > 0;
 }
 
-function isNonNegativeNumber(value: number): boolean {
-  return value >= 0;
-}
+function isNonNegativeNumber(value: number): boolean {}
 
 function isValidIsoDate(value: string): boolean {

[Survived] ConditionalExpression
src/lib/garden-beds.ts:585:10
 }
 
 function isNonNegativeNumber(value: number): boolean {
-  return value >= 0;
+  return false;
 }
 

[Survived] EqualityOperator
src/lib/garden-beds.ts:585:10
 }
 
 function isNonNegativeNumber(value: number): boolean {
-  return value >= 0;
+  return value < 0;
 }
 

[Survived] BlockStatement
src/lib/garden-beds.ts:588:49
   return value >= 0;
 }
 
-function isValidIsoDate(value: string): boolean {
-  return parseIsoDate(value) !== null;
-}
+function isValidIsoDate(value: string): boolean {}
 
 function parseIsoDate(value: string): Date | null {

[Survived] ConditionalExpression
src/lib/garden-beds.ts:589:10
 }
 
 function isValidIsoDate(value: string): boolean {
-  return parseIsoDate(value) !== null;
+  return true;
 }
 

[Survived] ConditionalExpression
src/lib/garden-beds.ts:589:10
 }
 
 function isValidIsoDate(value: string): boolean {
-  return parseIsoDate(value) !== null;
+  return false;
 }
 

[Killed] BlockStatement
src/lib/garden-beds.ts:592:51
   return parseIsoDate(value) !== null;
 }
 
-function parseIsoDate(value: string): Date | null {
-  const match = /^(\d{4})-(\d{2})-(\d{2})$/.exec(value);
-  if (!match) return null;
-
-  const year = Number(match[1]);
-  const month = Number(match[2]);
-  const day = Number(match[3]);
-
-  const date = new Date(Date.UTC(year, month - 1, day));
-
-  if (date.getUTCFullYear() !== year || date.getUTCMonth() !== month - 1 || date.getUTCDate() !== day) {
-    return null;
-  }
-
-  return date;
-}
+function parseIsoDate(value: string): Date | null {}
 
 function formatIsoDate(date: Date): string {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] Regex
src/lib/garden-beds.ts:593:17
 }
 
 function parseIsoDate(value: string): Date | null {
-  const match = /^(\d{4})-(\d{2})-(\d{2})$/.exec(value);
+  const match = /^(\D{4})-(\d{2})-(\d{2})$/.exec(value);
   if (!match) return null;
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] Regex
src/lib/garden-beds.ts:593:17
 }
 
 function parseIsoDate(value: string): Date | null {
-  const match = /^(\d{4})-(\d{2})-(\d{2})$/.exec(value);
+  const match = /^(\d)-(\d{2})-(\d{2})$/.exec(value);
   if (!match) return null;
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/garden-beds.ts:594:7
 
 function parseIsoDate(value: string): Date | null {
   const match = /^(\d{4})-(\d{2})-(\d{2})$/.exec(value);
-  if (!match) return null;
+  if (true) return null;
 
   const year = Number(match[1]);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/garden-beds.ts:594:7
 
 function parseIsoDate(value: string): Date | null {
   const match = /^(\d{4})-(\d{2})-(\d{2})$/.exec(value);
-  if (!match) return null;
+  if (match) return null;
 
   const year = Number(match[1]);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArithmeticOperator
src/lib/garden-beds.ts:600:40
   const month = Number(match[2]);
   const day = Number(match[3]);
 
-  const date = new Date(Date.UTC(year, month - 1, day));
+  const date = new Date(Date.UTC(year, month + 1, day));
 
   if (date.getUTCFullYear() !== year || date.getUTCMonth() !== month - 1 || date.getUTCDate() !== day) {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:602:77
 
   const date = new Date(Date.UTC(year, month - 1, day));
 
-  if (date.getUTCFullYear() !== year || date.getUTCMonth() !== month - 1 || date.getUTCDate() !== day) {
+  if (date.getUTCFullYear() !== year || date.getUTCMonth() !== month - 1 || date.getUTCDate() === day) {
     return null;
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/garden-beds.ts:602:41
 
   const date = new Date(Date.UTC(year, month - 1, day));
 
-  if (date.getUTCFullYear() !== year || date.getUTCMonth() !== month - 1 || date.getUTCDate() !== day) {
+  if (date.getUTCFullYear() !== year || date.getUTCMonth() === month - 1 || date.getUTCDate() !== day) {
     return null;
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:609:44
   return date;
 }
 
-function formatIsoDate(date: Date): string {
-  return date.toISOString().slice(0, 10);
-}
+function formatIsoDate(date: Date): string {}
 
 function startOfUtcToday(): Date {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] MethodExpression
src/lib/garden-beds.ts:610:10
 }
 
 function formatIsoDate(date: Date): string {
-  return date.toISOString().slice(0, 10);
+  return date.toISOString();
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/garden-beds.ts:613:34
   return date.toISOString().slice(0, 10);
 }
 
-function startOfUtcToday(): Date {
-  const now = new Date();
-  return new Date(Date.UTC(now.getUTCFullYear(), now.getUTCMonth(), now.getUTCDate()));
-}
+function startOfUtcToday(): Date {}
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL
