[Killed] ConditionalExpression
src/lib/weed-observations.ts:289:7
 const coverageSet = new Set<string>(OBSERVATION_COVERAGES);
 
 export function validateCreateWeedObservationInput(value: unknown): WeedObservationValidationResult {
-  if (!isRecord(value)) {
+  if (true) {
     return { success: false, error: "Weed observation payload must be an object." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:289:7
 const coverageSet = new Set<string>(OBSERVATION_COVERAGES);
 
 export function validateCreateWeedObservationInput(value: unknown): WeedObservationValidationResult {
-  if (!isRecord(value)) {
+  if (isRecord(value)) {
     return { success: false, error: "Weed observation payload must be an object." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BooleanLiteral
src/lib/weed-observations.ts:290:23
 
 export function validateCreateWeedObservationInput(value: unknown): WeedObservationValidationResult {
   if (!isRecord(value)) {
-    return { success: false, error: "Weed observation payload must be an object." };
+    return { success: true, error: "Weed observation payload must be an object." };
   }
 

[Survived] ObjectLiteral
src/lib/weed-observations.ts:290:12
 
 export function validateCreateWeedObservationInput(value: unknown): WeedObservationValidationResult {
   if (!isRecord(value)) {
-    return { success: false, error: "Weed observation payload must be an object." };
+    return {};
   }
 

[Killed] ConditionalExpression
src/lib/weed-observations.ts:294:7
   }
 
   const observedAt = value.observed_at;
-  if (typeof observedAt !== "string" || !isValidPastOrTodayIsoDate(observedAt)) {
+  if (false) {
     return { success: false, error: "Observation date must be a valid YYYY-MM-DD date that is not in the future." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:294:41
   }
 
   const observedAt = value.observed_at;
-  if (typeof observedAt !== "string" || !isValidPastOrTodayIsoDate(observedAt)) {
+  if (typeof observedAt !== "string" || isValidPastOrTodayIsoDate(observedAt)) {
     return { success: false, error: "Observation date must be a valid YYYY-MM-DD date that is not in the future." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:295:23
 
   const observedAt = value.observed_at;
   if (typeof observedAt !== "string" || !isValidPastOrTodayIsoDate(observedAt)) {
-    return { success: false, error: "Observation date must be a valid YYYY-MM-DD date that is not in the future." };
+    return { success: true, error: "Observation date must be a valid YYYY-MM-DD date that is not in the future." };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] StringLiteral
src/lib/weed-observations.ts:295:37
 
   const observedAt = value.observed_at;
   if (typeof observedAt !== "string" || !isValidPastOrTodayIsoDate(observedAt)) {
-    return { success: false, error: "Observation date must be a valid YYYY-MM-DD date that is not in the future." };
+    return { success: false, error: "" };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/weed-observations.ts:299:38
   }
 
   const weedCategory = value.weed_category;
-  if (!isWeedCategory(weedCategory)) {
-    return { success: false, error: "Weed category is required and must be a supported value." };
-  }
+  if (!isWeedCategory(weedCategory)) {}
 
   const growthStage = value.growth_stage;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:299:7
   }
 
   const weedCategory = value.weed_category;
-  if (!isWeedCategory(weedCategory)) {
+  if (false) {
     return { success: false, error: "Weed category is required and must be a supported value." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:300:23
 
   const weedCategory = value.weed_category;
   if (!isWeedCategory(weedCategory)) {
-    return { success: false, error: "Weed category is required and must be a supported value." };
+    return { success: true, error: "Weed category is required and must be a supported value." };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/weed-observations.ts:304:36
   }
 
   const growthStage = value.growth_stage;
-  if (!isGrowthStage(growthStage)) {
-    return { success: false, error: "Growth stage is required and must be a supported value." };
-  }
+  if (!isGrowthStage(growthStage)) {}
 
   const coverage = value.coverage;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:304:7
   }
 
   const growthStage = value.growth_stage;
-  if (!isGrowthStage(growthStage)) {
+  if (false) {
     return { success: false, error: "Growth stage is required and must be a supported value." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:305:23
 
   const growthStage = value.growth_stage;
   if (!isGrowthStage(growthStage)) {
-    return { success: false, error: "Growth stage is required and must be a supported value." };
+    return { success: true, error: "Growth stage is required and must be a supported value." };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/weed-observations.ts:309:41
   }
 
   const coverage = value.coverage;
-  if (!isObservationCoverage(coverage)) {
-    return { success: false, error: "Coverage is required and must be low, medium, or high." };
-  }
+  if (!isObservationCoverage(coverage)) {}
 
   const severity = value.severity;
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:309:7
   }
 
   const coverage = value.coverage;
-  if (!isObservationCoverage(coverage)) {
+  if (isObservationCoverage(coverage)) {
     return { success: false, error: "Coverage is required and must be low, medium, or high." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:310:23
 
   const coverage = value.coverage;
   if (!isObservationCoverage(coverage)) {
-    return { success: false, error: "Coverage is required and must be low, medium, or high." };
+    return { success: true, error: "Coverage is required and must be low, medium, or high." };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:314:7
   }
 
   const severity = value.severity;
-  if (typeof severity !== "number" || !Number.isInteger(severity) || severity < 1 || severity > 5) {
+  if (true) {
     return { success: false, error: "Severity must be an integer from 1 through 5." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] LogicalOperator
src/lib/weed-observations.ts:314:7
   }
 
   const severity = value.severity;
-  if (typeof severity !== "number" || !Number.isInteger(severity) || severity < 1 || severity > 5) {
+  if ((typeof severity !== "number" || !Number.isInteger(severity) || severity < 1) && severity > 5) {
     return { success: false, error: "Severity must be an integer from 1 through 5." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:315:23
 
   const severity = value.severity;
   if (typeof severity !== "number" || !Number.isInteger(severity) || severity < 1 || severity > 5) {
-    return { success: false, error: "Severity must be an integer from 1 through 5." };
+    return { success: true, error: "Severity must be an integer from 1 through 5." };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] StringLiteral
src/lib/weed-observations.ts:315:37
 
   const severity = value.severity;
   if (typeof severity !== "number" || !Number.isInteger(severity) || severity < 1 || severity > 5) {
-    return { success: false, error: "Severity must be an integer from 1 through 5." };
+    return { success: false, error: "" };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:319:7
   }
 
   const weedCatalogSlug = readOptionalTrimmedString(value, "weed_catalog_slug", "Weed catalog slug cannot be empty.");
-  if (!weedCatalogSlug.success) return weedCatalogSlug;
+  if (weedCatalogSlug.success) return weedCatalogSlug;
 
   const weedName = readOptionalTrimmedString(value, "weed_name", "Weed name cannot be empty.");
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:319:7
   }
 
   const weedCatalogSlug = readOptionalTrimmedString(value, "weed_catalog_slug", "Weed catalog slug cannot be empty.");
-  if (!weedCatalogSlug.success) return weedCatalogSlug;
+  if (true) return weedCatalogSlug;
 
   const weedName = readOptionalTrimmedString(value, "weed_name", "Weed name cannot be empty.");
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:322:7
   if (!weedCatalogSlug.success) return weedCatalogSlug;
 
   const weedName = readOptionalTrimmedString(value, "weed_name", "Weed name cannot be empty.");
-  if (!weedName.success) return weedName;
+  if (weedName.success) return weedName;
 
   const note = readOptionalTrimmedString(value, "note", "Observation note cannot be empty.");
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:322:7
   if (!weedCatalogSlug.success) return weedCatalogSlug;
 
   const weedName = readOptionalTrimmedString(value, "weed_name", "Weed name cannot be empty.");
-  if (!weedName.success) return weedName;
+  if (true) return weedName;
 
   const note = readOptionalTrimmedString(value, "note", "Observation note cannot be empty.");
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:325:7
   if (!weedName.success) return weedName;
 
   const note = readOptionalTrimmedString(value, "note", "Observation note cannot be empty.");
-  if (!note.success) return note;
+  if (note.success) return note;
 
   const traits = readRiskTraits(value);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:325:7
   if (!weedName.success) return weedName;
 
   const note = readOptionalTrimmedString(value, "note", "Observation note cannot be empty.");
-  if (!note.success) return note;
+  if (false) return note;
 
   const traits = readRiskTraits(value);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:328:7
   if (!note.success) return note;
 
   const traits = readRiskTraits(value);
-  if (!traits.success) return traits;
+  if (true) return traits;
 
   return {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:328:7
   if (!note.success) return note;
 
   const traits = readRiskTraits(value);
-  if (!traits.success) return traits;
+  if (traits.success) return traits;
 
   return {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ObjectLiteral
src/lib/weed-observations.ts:330:10
   const traits = readRiskTraits(value);
   if (!traits.success) return traits;
 
-  return {
-    success: true,
-    data: {
-      observed_at: observedAt,
-      weed_category: weedCategory,
-      growth_stage: growthStage,
-      coverage,
-      severity,
-      weed_catalog_slug: weedCatalogSlug.value,
-      weed_name: weedName.value,
-      note: note.value,
-      ...traits.value,
-    },
-  };
+  return {};
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BlockStatement
src/lib/weed-observations.ts:350:33
   input: CreateWeedObservationInput,
   bedId: string,
   userId: string,
-): WeedObservationInsertPayload {
-  return {
-    bed_id: bedId,
-    user_id: userId,
-    observed_at: input.observed_at,
-    weed_catalog_slug: input.weed_catalog_slug ?? null,
-    weed_name: input.weed_name ?? null,
-    weed_category: input.weed_category,
-    growth_stage: input.growth_stage,
-    coverage: input.coverage,
-    severity: input.severity,
-    spreads_by_rhizomes: input.spreads_by_rhizomes ?? false,
-    spreads_by_stolons: input.spreads_by_stolons ?? false,
-    spreads_by_tubers: input.spreads_by_tubers ?? false,
-    regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
-    prolific_seed_producer: input.prolific_seed_producer ?? false,
-    fast_regrowth: input.fast_regrowth ?? false,
-    note: input.note ?? null,
-  };
-}
+): WeedObservationInsertPayload {}
 
 export function toWeedObservationResponse(row: WeedObservationRow): WeedObservationResponse {

[Survived] LogicalOperator
src/lib/weed-observations.ts:355:24
     bed_id: bedId,
     user_id: userId,
     observed_at: input.observed_at,
-    weed_catalog_slug: input.weed_catalog_slug ?? null,
+    weed_catalog_slug: input.weed_catalog_slug && null,
     weed_name: input.weed_name ?? null,
     weed_category: input.weed_category,

[Survived] LogicalOperator
src/lib/weed-observations.ts:356:16
     user_id: userId,
     observed_at: input.observed_at,
     weed_catalog_slug: input.weed_catalog_slug ?? null,
-    weed_name: input.weed_name ?? null,
+    weed_name: input.weed_name && null,
     weed_category: input.weed_category,
     growth_stage: input.growth_stage,

[Survived] BooleanLiteral
src/lib/weed-observations.ts:361:55
     growth_stage: input.growth_stage,
     coverage: input.coverage,
     severity: input.severity,
-    spreads_by_rhizomes: input.spreads_by_rhizomes ?? false,
+    spreads_by_rhizomes: input.spreads_by_rhizomes ?? true,
     spreads_by_stolons: input.spreads_by_stolons ?? false,
     spreads_by_tubers: input.spreads_by_tubers ?? false,

[Survived] LogicalOperator
src/lib/weed-observations.ts:361:26
     growth_stage: input.growth_stage,
     coverage: input.coverage,
     severity: input.severity,
-    spreads_by_rhizomes: input.spreads_by_rhizomes ?? false,
+    spreads_by_rhizomes: input.spreads_by_rhizomes && false,
     spreads_by_stolons: input.spreads_by_stolons ?? false,
     spreads_by_tubers: input.spreads_by_tubers ?? false,

[Survived] BooleanLiteral
src/lib/weed-observations.ts:362:53
     coverage: input.coverage,
     severity: input.severity,
     spreads_by_rhizomes: input.spreads_by_rhizomes ?? false,
-    spreads_by_stolons: input.spreads_by_stolons ?? false,
+    spreads_by_stolons: input.spreads_by_stolons ?? true,
     spreads_by_tubers: input.spreads_by_tubers ?? false,
     regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,

[Survived] LogicalOperator
src/lib/weed-observations.ts:362:25
     coverage: input.coverage,
     severity: input.severity,
     spreads_by_rhizomes: input.spreads_by_rhizomes ?? false,
-    spreads_by_stolons: input.spreads_by_stolons ?? false,
+    spreads_by_stolons: input.spreads_by_stolons && false,
     spreads_by_tubers: input.spreads_by_tubers ?? false,
     regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,

[Survived] BooleanLiteral
src/lib/weed-observations.ts:363:51
     severity: input.severity,
     spreads_by_rhizomes: input.spreads_by_rhizomes ?? false,
     spreads_by_stolons: input.spreads_by_stolons ?? false,
-    spreads_by_tubers: input.spreads_by_tubers ?? false,
+    spreads_by_tubers: input.spreads_by_tubers ?? true,
     regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
     prolific_seed_producer: input.prolific_seed_producer ?? false,

[Survived] LogicalOperator
src/lib/weed-observations.ts:363:24
     severity: input.severity,
     spreads_by_rhizomes: input.spreads_by_rhizomes ?? false,
     spreads_by_stolons: input.spreads_by_stolons ?? false,
-    spreads_by_tubers: input.spreads_by_tubers ?? false,
+    spreads_by_tubers: input.spreads_by_tubers && false,
     regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
     prolific_seed_producer: input.prolific_seed_producer ?? false,

[Survived] BooleanLiteral
src/lib/weed-observations.ts:364:71
     spreads_by_rhizomes: input.spreads_by_rhizomes ?? false,
     spreads_by_stolons: input.spreads_by_stolons ?? false,
     spreads_by_tubers: input.spreads_by_tubers ?? false,
-    regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
+    regrows_from_root_fragments: input.regrows_from_root_fragments ?? true,
     prolific_seed_producer: input.prolific_seed_producer ?? false,
     fast_regrowth: input.fast_regrowth ?? false,

[Survived] LogicalOperator
src/lib/weed-observations.ts:364:34
     spreads_by_rhizomes: input.spreads_by_rhizomes ?? false,
     spreads_by_stolons: input.spreads_by_stolons ?? false,
     spreads_by_tubers: input.spreads_by_tubers ?? false,
-    regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
+    regrows_from_root_fragments: input.regrows_from_root_fragments && false,
     prolific_seed_producer: input.prolific_seed_producer ?? false,
     fast_regrowth: input.fast_regrowth ?? false,

[Survived] LogicalOperator
src/lib/weed-observations.ts:365:29
     spreads_by_stolons: input.spreads_by_stolons ?? false,
     spreads_by_tubers: input.spreads_by_tubers ?? false,
     regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
-    prolific_seed_producer: input.prolific_seed_producer ?? false,
+    prolific_seed_producer: input.prolific_seed_producer && false,
     fast_regrowth: input.fast_regrowth ?? false,
     note: input.note ?? null,

[Survived] BooleanLiteral
src/lib/weed-observations.ts:365:61
     spreads_by_stolons: input.spreads_by_stolons ?? false,
     spreads_by_tubers: input.spreads_by_tubers ?? false,
     regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
-    prolific_seed_producer: input.prolific_seed_producer ?? false,
+    prolific_seed_producer: input.prolific_seed_producer ?? true,
     fast_regrowth: input.fast_regrowth ?? false,
     note: input.note ?? null,

[Survived] LogicalOperator
src/lib/weed-observations.ts:366:20
     spreads_by_tubers: input.spreads_by_tubers ?? false,
     regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
     prolific_seed_producer: input.prolific_seed_producer ?? false,
-    fast_regrowth: input.fast_regrowth ?? false,
+    fast_regrowth: input.fast_regrowth && false,
     note: input.note ?? null,
   };

[Survived] BooleanLiteral
src/lib/weed-observations.ts:366:43
     spreads_by_tubers: input.spreads_by_tubers ?? false,
     regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
     prolific_seed_producer: input.prolific_seed_producer ?? false,
-    fast_regrowth: input.fast_regrowth ?? false,
+    fast_regrowth: input.fast_regrowth ?? true,
     note: input.note ?? null,
   };

[Survived] LogicalOperator
src/lib/weed-observations.ts:367:11
     regrows_from_root_fragments: input.regrows_from_root_fragments ?? false,
     prolific_seed_producer: input.prolific_seed_producer ?? false,
     fast_regrowth: input.fast_regrowth ?? false,
-    note: input.note ?? null,
+    note: input.note && null,
   };
 }

[Survived] BlockStatement
src/lib/weed-observations.ts:371:93
   };
 }
 
-export function toWeedObservationResponse(row: WeedObservationRow): WeedObservationResponse {
-  const { user_id: _userId, ...response } = row;
-  return response;
-}
+export function toWeedObservationResponse(row: WeedObservationRow): WeedObservationResponse {}
 
 function isRecord(value: unknown): value is Record<string, unknown> {

[Killed] EqualityOperator
src/lib/weed-observations.ts:377:39
 }
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return typeof value === "object" && value === null && !Array.isArray(value);
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/weed-observations.ts:380:64
   return typeof value === "object" && value !== null && !Array.isArray(value);
 }
 
-function isWeedCategory(value: unknown): value is WeedCategory {
-  return typeof value === "string" && weedCategorySet.has(value);
-}
+function isWeedCategory(value: unknown): value is WeedCategory {}
 
 function isGrowthStage(value: unknown): value is GrowthStage {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:381:10
 }
 
 function isWeedCategory(value: unknown): value is WeedCategory {
-  return typeof value === "string" && weedCategorySet.has(value);
+  return false;
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:381:10
 }
 
 function isWeedCategory(value: unknown): value is WeedCategory {
-  return typeof value === "string" && weedCategorySet.has(value);
+  return true;
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/weed-observations.ts:384:62
   return typeof value === "string" && weedCategorySet.has(value);
 }
 
-function isGrowthStage(value: unknown): value is GrowthStage {
-  return typeof value === "string" && growthStageSet.has(value);
-}
+function isGrowthStage(value: unknown): value is GrowthStage {}
 
 function isObservationCoverage(value: unknown): value is ObservationCoverage {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:385:10
 }
 
 function isGrowthStage(value: unknown): value is GrowthStage {
-  return typeof value === "string" && growthStageSet.has(value);
+  return false;
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:385:10
 }
 
 function isGrowthStage(value: unknown): value is GrowthStage {
-  return typeof value === "string" && growthStageSet.has(value);
+  return true;
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/weed-observations.ts:388:78
   return typeof value === "string" && growthStageSet.has(value);
 }
 
-function isObservationCoverage(value: unknown): value is ObservationCoverage {
-  return typeof value === "string" && coverageSet.has(value);
-}
+function isObservationCoverage(value: unknown): value is ObservationCoverage {}
 
 type OptionalStringResult = { success: true; value: string | null } | { success: false; error: string };
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/weed-observations.ts:389:10
 }
 
 function isObservationCoverage(value: unknown): value is ObservationCoverage {
-  return typeof value === "string" && coverageSet.has(value);
+  return typeof value !== "string" && coverageSet.has(value);
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] LogicalOperator
src/lib/weed-observations.ts:389:10
 }
 
 function isObservationCoverage(value: unknown): value is ObservationCoverage {
-  return typeof value === "string" && coverageSet.has(value);
+  return typeof value === "string" || coverageSet.has(value);
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/weed-observations.ts:394:119
 
 type OptionalStringResult = { success: true; value: string | null } | { success: false; error: string };
 
-function readOptionalTrimmedString(source: Record<string, unknown>, key: string, error: string): OptionalStringResult {
-  const value = source[key];
-
-  if (value === undefined || value === null) {
-    return { success: true, value: null };
-  }
-
-  if (typeof value !== "string" || value.trim().length === 0) {
-    return { success: false, error };
-  }
-
-  return { success: true, value: value.trim() };
-}
+function readOptionalTrimmedString(source: Record<string, unknown>, key: string, error: string): OptionalStringResult {}
 
 type RiskTraitReadResult = { success: true; value: Record<WeedRiskTrait, boolean> } | { success: false; error: string };
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/weed-observations.ts:397:7
 function readOptionalTrimmedString(source: Record<string, unknown>, key: string, error: string): OptionalStringResult {
   const value = source[key];
 
-  if (value === undefined || value === null) {
+  if (value !== undefined || value === null) {
     return { success: true, value: null };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] LogicalOperator
src/lib/weed-observations.ts:401:7
     return { success: true, value: null };
   }
 
-  if (typeof value !== "string" || value.trim().length === 0) {
+  if (typeof value !== "string" && value.trim().length === 0) {
     return { success: false, error };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL
