[Killed] EqualityOperator
src/lib/weed-observations.ts:401:7
     return { success: true, value: null };
   }
 
-  if (typeof value !== "string" || value.trim().length === 0) {
+  if (typeof value === "string" || value.trim().length === 0) {
     return { success: false, error };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:402:23
   }
 
   if (typeof value !== "string" || value.trim().length === 0) {
-    return { success: false, error };
+    return { success: true, error };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] MethodExpression
src/lib/weed-observations.ts:405:34
     return { success: false, error };
   }
 
-  return { success: true, value: value.trim() };
+  return { success: true, value: value };
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:405:21
     return { success: false, error };
   }
 
-  return { success: true, value: value.trim() };
+  return { success: false, value: value.trim() };
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/weed-observations.ts:410:79
 
 type RiskTraitReadResult = { success: true; value: Record<WeedRiskTrait, boolean> } | { success: false; error: string };
 
-function readRiskTraits(source: Record<string, unknown>): RiskTraitReadResult {
-  const value = Object.fromEntries(WEED_RISK_TRAITS.map((trait) => [trait, false])) as Record<WeedRiskTrait, boolean>;
-
-  for (const trait of WEED_RISK_TRAITS) {
-    const raw = source[trait];
-    if (raw === undefined || raw === null) continue;
-    if (typeof raw !== "boolean") {
-      return { success: false, error: `${WEED_RISK_TRAIT_LABELS[trait]} must be true or false.` };
-    }
-    value[trait] = raw;
-  }
-
-  return { success: true, value };
-}
+function readRiskTraits(source: Record<string, unknown>): RiskTraitReadResult {}
 
 function isValidPastOrTodayIsoDate(value: string): boolean {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BlockStatement
src/lib/weed-observations.ts:413:41
 function readRiskTraits(source: Record<string, unknown>): RiskTraitReadResult {
   const value = Object.fromEntries(WEED_RISK_TRAITS.map((trait) => [trait, false])) as Record<WeedRiskTrait, boolean>;
 
-  for (const trait of WEED_RISK_TRAITS) {
-    const raw = source[trait];
-    if (raw === undefined || raw === null) continue;
-    if (typeof raw !== "boolean") {
-      return { success: false, error: `${WEED_RISK_TRAIT_LABELS[trait]} must be true or false.` };
-    }
-    value[trait] = raw;
-  }
+  for (const trait of WEED_RISK_TRAITS) {}
 
   return { success: true, value };

[Survived] LogicalOperator
src/lib/weed-observations.ts:415:9
 
   for (const trait of WEED_RISK_TRAITS) {
     const raw = source[trait];
-    if (raw === undefined || raw === null) continue;
+    if (raw === undefined && raw === null) continue;
     if (typeof raw !== "boolean") {
       return { success: false, error: `${WEED_RISK_TRAIT_LABELS[trait]} must be true or false.` };

[Survived] EqualityOperator
src/lib/weed-observations.ts:415:9
 
   for (const trait of WEED_RISK_TRAITS) {
     const raw = source[trait];
-    if (raw === undefined || raw === null) continue;
+    if (raw !== undefined || raw === null) continue;
     if (typeof raw !== "boolean") {
       return { success: false, error: `${WEED_RISK_TRAIT_LABELS[trait]} must be true or false.` };

[Killed] ConditionalExpression
src/lib/weed-observations.ts:416:9
   for (const trait of WEED_RISK_TRAITS) {
     const raw = source[trait];
     if (raw === undefined || raw === null) continue;
-    if (typeof raw !== "boolean") {
+    if (true) {
       return { success: false, error: `${WEED_RISK_TRAIT_LABELS[trait]} must be true or false.` };
     }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run



 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/weed-observations.ts:416:9
   for (const trait of WEED_RISK_TRAITS) {
     const raw = source[trait];
     if (raw === undefined || raw === null) continue;
-    if (typeof raw !== "boolean") {
+    if (typeof raw === "boolean") {
       return { success: false, error: `${WEED_RISK_TRAIT_LABELS[trait]} must be true or false.` };
     }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BooleanLiteral
src/lib/weed-observations.ts:417:25
     const raw = source[trait];
     if (raw === undefined || raw === null) continue;
     if (typeof raw !== "boolean") {
-      return { success: false, error: `${WEED_RISK_TRAIT_LABELS[trait]} must be true or false.` };
+      return { success: true, error: `${WEED_RISK_TRAIT_LABELS[trait]} must be true or false.` };
     }
     value[trait] = raw;

[Survived] ObjectLiteral
src/lib/weed-observations.ts:417:14
     const raw = source[trait];
     if (raw === undefined || raw === null) continue;
     if (typeof raw !== "boolean") {
-      return { success: false, error: `${WEED_RISK_TRAIT_LABELS[trait]} must be true or false.` };
+      return {};
     }
     value[trait] = raw;

[Killed] BlockStatement
src/lib/weed-observations.ts:425:60
   return { success: true, value };
 }
 
-function isValidPastOrTodayIsoDate(value: string): boolean {
-  const date = parseIsoDate(value);
-  if (!date) return false;
-  return date.getTime() <= startOfUtcToday().getTime();
-}
+function isValidPastOrTodayIsoDate(value: string): boolean {}
 
 function parseIsoDate(value: string): Date | null {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weed-observations.ts:427:7
 
 function isValidPastOrTodayIsoDate(value: string): boolean {
   const date = parseIsoDate(value);
-  if (!date) return false;
+  if (date) return false;
   return date.getTime() <= startOfUtcToday().getTime();
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:427:7
 
 function isValidPastOrTodayIsoDate(value: string): boolean {
   const date = parseIsoDate(value);
-  if (!date) return false;
+  if (true) return false;
   return date.getTime() <= startOfUtcToday().getTime();
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/weed-observations.ts:428:10
 function isValidPastOrTodayIsoDate(value: string): boolean {
   const date = parseIsoDate(value);
   if (!date) return false;
-  return date.getTime() <= startOfUtcToday().getTime();
+  return date.getTime() > startOfUtcToday().getTime();
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/weed-observations.ts:428:10
 function isValidPastOrTodayIsoDate(value: string): boolean {
   const date = parseIsoDate(value);
   if (!date) return false;
-  return date.getTime() <= startOfUtcToday().getTime();
+  return date.getTime() < startOfUtcToday().getTime();
 }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BlockStatement
src/lib/weed-observations.ts:431:51
   return date.getTime() <= startOfUtcToday().getTime();
 }
 
-function parseIsoDate(value: string): Date | null {
-  const match = /^(\d{4})-(\d{2})-(\d{2})$/.exec(value);
-  if (!match) return null;
-
-  const year = Number(match[1]);
-  const month = Number(match[2]);
-  const day = Number(match[3]);
-  const date = new Date(Date.UTC(year, month - 1, day));
-
-  if (date.getUTCFullYear() !== year || date.getUTCMonth() !== month - 1 || date.getUTCDate() !== day) {
-    return null;
-  }
-
-  return date;
-}
+function parseIsoDate(value: string): Date | null {}
 
 function startOfUtcToday(): Date {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] Regex
src/lib/weed-observations.ts:432:17
 }
 
 function parseIsoDate(value: string): Date | null {
-  const match = /^(\d{4})-(\d{2})-(\d{2})$/.exec(value);
+  const match = /^(\d{4})-(\d)-(\d{2})$/.exec(value);
   if (!match) return null;
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] Regex
src/lib/weed-observations.ts:432:17
 }
 
 function parseIsoDate(value: string): Date | null {
-  const match = /^(\d{4})-(\d{2})-(\d{2})$/.exec(value);
+  const match = /^(\d{4})-(\d{2})-(\D{2})$/.exec(value);
   if (!match) return null;
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ArithmeticOperator
src/lib/weed-observations.ts:438:40
   const year = Number(match[1]);
   const month = Number(match[2]);
   const day = Number(match[3]);
-  const date = new Date(Date.UTC(year, month - 1, day));
+  const date = new Date(Date.UTC(year, month + 1, day));
 
   if (date.getUTCFullYear() !== year || date.getUTCMonth() !== month - 1 || date.getUTCDate() !== day) {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weed-observations.ts:440:7
   const day = Number(match[3]);
   const date = new Date(Date.UTC(year, month - 1, day));
 
-  if (date.getUTCFullYear() !== year || date.getUTCMonth() !== month - 1 || date.getUTCDate() !== day) {
+  if (true) {
     return null;
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL
