[Killed] ConditionalExpression
src/lib/weeding-events.ts:31:7
   | { success: false; error: string };
 
 export function validateMarkBedWeededInput(value: unknown): WeedingEventValidationResult {
-  if (!isRecord(value)) {
+  if (true) {
     return { success: false, error: "Mark-weeding payload must be an object." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weeding-events.ts:31:7
   | { success: false; error: string };
 
 export function validateMarkBedWeededInput(value: unknown): WeedingEventValidationResult {
-  if (!isRecord(value)) {
+  if (isRecord(value)) {
     return { success: false, error: "Mark-weeding payload must be an object." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BooleanLiteral
src/lib/weeding-events.ts:32:23
 
 export function validateMarkBedWeededInput(value: unknown): WeedingEventValidationResult {
   if (!isRecord(value)) {
-    return { success: false, error: "Mark-weeding payload must be an object." };
+    return { success: true, error: "Mark-weeding payload must be an object." };
   }
 

[Killed] BooleanLiteral
src/lib/weeding-events.ts:36:39
   }
 
   const weededAt = value.weeded_at;
-  if (typeof weededAt !== "string" || !isValidPastOrTodayIsoDate(weededAt)) {
+  if (typeof weededAt !== "string" || isValidPastOrTodayIsoDate(weededAt)) {
     return { success: false, error: "Weeding date must be a valid YYYY-MM-DD date that is not in the future." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weeding-events.ts:36:7
   }
 
   const weededAt = value.weeded_at;
-  if (typeof weededAt !== "string" || !isValidPastOrTodayIsoDate(weededAt)) {
+  if (true) {
     return { success: false, error: "Weeding date must be a valid YYYY-MM-DD date that is not in the future." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weeding-events.ts:37:23
 
   const weededAt = value.weeded_at;
   if (typeof weededAt !== "string" || !isValidPastOrTodayIsoDate(weededAt)) {
-    return { success: false, error: "Weeding date must be a valid YYYY-MM-DD date that is not in the future." };
+    return { success: true, error: "Weeding date must be a valid YYYY-MM-DD date that is not in the future." };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weeding-events.ts:41:84
   }
 
   const durationMinutes = value.duration_minutes;
-  if (typeof durationMinutes !== "number" || !Number.isInteger(durationMinutes) || durationMinutes <= 0) {
+  if (typeof durationMinutes !== "number" || !Number.isInteger(durationMinutes) || false) {
     return { success: false, error: "Duration minutes must be a positive integer." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weeding-events.ts:41:7
   }
 
   const durationMinutes = value.duration_minutes;
-  if (typeof durationMinutes !== "number" || !Number.isInteger(durationMinutes) || durationMinutes <= 0) {
+  if (true) {
     return { success: false, error: "Duration minutes must be a positive integer." };
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weeding-events.ts:42:23
 
   const durationMinutes = value.duration_minutes;
   if (typeof durationMinutes !== "number" || !Number.isInteger(durationMinutes) || durationMinutes <= 0) {
-    return { success: false, error: "Duration minutes must be a positive integer." };
+    return { success: true, error: "Duration minutes must be a positive integer." };
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] StringLiteral
src/lib/weeding-events.ts:45:57
     return { success: false, error: "Duration minutes must be a positive integer." };
   }
 
-  const note = readOptionalTrimmedString(value, "note", "Weeding note cannot be empty.");
+  const note = readOptionalTrimmedString(value, "note", "");
   if (!note.success) return note;
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weeding-events.ts:46:7
   }
 
   const note = readOptionalTrimmedString(value, "note", "Weeding note cannot be empty.");
-  if (!note.success) return note;
+  if (true) return note;
 
   return {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] BooleanLiteral
src/lib/weeding-events.ts:46:7
   }
 
   const note = readOptionalTrimmedString(value, "note", "Weeding note cannot be empty.");
-  if (!note.success) return note;
+  if (note.success) return note;
 
   return {
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Survived] BlockStatement
src/lib/weeding-events.ts:62:30
   input: MarkBedWeededInput,
   bedId: string,
   userId: string,
-): WeedingEventInsertPayload {
-  return {
-    bed_id: bedId,
-    user_id: userId,
-    weeded_at: input.weeded_at,
-    duration_minutes: input.duration_minutes,
-    note: input.note ?? null,
-  };
-}
+): WeedingEventInsertPayload {}
 
 export function toWeedingEventResponse(row: WeedingEventRow): WeedingEventResponse {

[Survived] LogicalOperator
src/lib/weeding-events.ts:68:11
     user_id: userId,
     weeded_at: input.weeded_at,
     duration_minutes: input.duration_minutes,
-    note: input.note ?? null,
+    note: input.note && null,
   };
 }

[Survived] BlockStatement
src/lib/weeding-events.ts:72:84
   };
 }
 
-export function toWeedingEventResponse(row: WeedingEventRow): WeedingEventResponse {
-  const { user_id: _userId, ...response } = row;
-  return response;
-}
+export function toWeedingEventResponse(row: WeedingEventRow): WeedingEventResponse {}
 
 function isRecord(value: unknown): value is Record<string, unknown> {

[Killed] BlockStatement
src/lib/weeding-events.ts:90:63
     return { success: true, value: null };
   }
 
-  if (typeof value !== "string" || value.trim().length === 0) {
-    return { success: false, error };
-  }
+  if (typeof value !== "string" || value.trim().length === 0) {}
 
   return { success: true, value: value.trim() };
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ObjectLiteral
src/lib/weeding-events.ts:91:12
   }
 
   if (typeof value !== "string" || value.trim().length === 0) {
-    return { success: false, error };
+    return {};
   }
 
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weeding-events.ts:99:7
 
 function isValidPastOrTodayIsoDate(value: string): boolean {
   const date = parseIsoDate(value);
-  if (!date) return false;
+  if (false) return false;
   return date.getTime() <= startOfUtcToday().getTime();
 }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] ConditionalExpression
src/lib/weeding-events.ts:105:7
 
 function parseIsoDate(value: string): Date | null {
   const match = /^(\d{4})-(\d{2})-(\d{2})$/.exec(value);
-  if (!match) return null;
+  if (false) return null;
 
   const year = Number(match[1]);
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL

[Killed] EqualityOperator
src/lib/weeding-events.ts:112:7
   const day = Number(match[3]);
   const date = new Date(Date.UTC(year, month - 1, day));
 
-  if (date.getUTCFullYear() !== year || date.getUTCMonth() !== month - 1 || date.getUTCDate() !== day) {
+  if (date.getUTCFullYear() === year || date.getUTCMonth() !== month - 1 || date.getUTCDate() !== day) {
     return null;
   }
killedBy: All tests
statusReason: > 10x-astro-starter@0.0.1 test
> vitest run




 RUN  v4.1.8 /home/simon/projects/garden-weed-planner/.stryker-tmp/sandbox-vQ0wqL
